Repository: routersys/YMM4-MIDI
Catalog: MIDI/Localization/Translate.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# CurrentCulture
source: en-us
ar_sa: ar-sa
es_es: es-es
id_id: id-id
ko_kr: ko-kr
zh_cn: zh-cn
zh_tw: zh-tw

# NoteVoicePluginName
source: Note Notation Synthesis
ar_sa: تركيب تدوين الملاحظات
es_es: Síntesis de Notación de Notas
ko_kr: 음표 표기법 합성
zh_cn: 音符记谱法合成
zh_tw: 音符記譜法合成

# NoteVoiceSettingsName
source: Note Notation Synthesis Settings
ar_sa: إعدادات تركيب تدوين الملاحظات
es_es: Configuración de Síntesis de Notación de Notas
ko_kr: 음표 표기법 합성 설정
zh_cn: 音符记谱法合成设置
zh_tw: 音符記譜法合成設定

# NoteVoiceSpeakerEngineName
source: Note Notation Synthesizer
ar_sa: مركب تدوين الملاحظات
es_es: Sintetizador de Notación de Notas
ko_kr: 음표 표기법 신디사이저
zh_cn: 音符记谱法合成器
zh_tw: 音符記譜法合成器

# KanjiToYomiNotSupported
source: Kanji to Yomi conversion is not supported.
ar_sa: تحويل كانجي إلى يومي غير مدعوم.
es_es: La conversión de Kanji a Yomi no es compatible.
ko_kr: 한자 읽기 변환은 지원되지 않습니다.
zh_cn: 不支持汉字到读音转换。
zh_tw: 不支援漢字到讀音轉換。

# CreateNewModelWindowTitle
source: Create New Model
ar_sa: إنشاء نموذج جديد
es_es: Crear Nuevo Modelo
ko_kr: 새 모델 만들기
zh_cn: 创建新模型
zh_tw: 建立新模型

# ModelNameLabel
source: Model Name:
ar_sa: اسم النموذج:
es_es: Nombre del Modelo:
ko_kr: 모델 이름:
zh_cn: 模型名称：
zh_tw: 模型名稱：

# ModelTypeLabel
source: Model Type:
ar_sa: نوع النموذج:
es_es: Tipo de Modelo:
ko_kr: 모델 유형:
zh_cn: 模型类型：
zh_tw: 模型類型：

# InternalSynthRadioButton
source: Internal Synth
ar_sa: مركب داخلي
es_es: Sintetizador Interno
ko_kr: 내장 신스
zh_cn: 内置合成器
zh_tw: 內建Synth

# CreateButton
source: Create
ar_sa: إنشاء
es_es: Crear
ko_kr: 만들기
zh_cn: 创建
zh_tw: 建立

# CancelButton
source: Cancel
ar_sa: إلغاء
es_es: Cancelar
ko_kr: 취소
zh_cn: 取消
zh_tw: 取消

# OkButton
source: OK
ar_sa: موافق
es_es: Aceptar
ko_kr: 확인
zh_cn: 确定
zh_tw: 確定

# NoteVoiceSettingsSampleRateLabel
source: Sample Rate (Hz)
ar_sa: معدل العينة (هرتز)
es_es: Tasa de Muestreo (Hz)
ko_kr: 샘플 속도 (Hz)
zh_cn: 采样率 (Hz)
zh_tw: 取樣率 (Hz)

# NoteVoiceSettingsModelSelectionHeader
source: Voice Model Selection
ar_sa: اختيار نموذج الصوت
es_es: Selección de Modelo de Voz
ko_kr: 음원 모델 선택
zh_cn: 音源模型选择
zh_tw: 音源模型選擇

# NoteVoiceSettingsNewButton
source: New
ar_sa: جديد
es_es: Nuevo
ko_kr: 신규
zh_cn: 新建
zh_tw: 新增

# NoteVoiceSettingsSaveButton
source: Save
ar_sa: حفظ
es_es: Guardar
ko_kr: 저장
zh_cn: 保存
zh_tw: 儲存

# NoteVoiceSettingsSoundFontLayerSettingsHeader
source: SoundFont Layer Settings
ar_sa: إعدادات طبقة SoundFont
es_es: Configuración de Capas de SoundFont
ko_kr: 사운드폰트 레이어 설정
zh_cn: SoundFont层设置
zh_tw: SoundFont圖層設定

# NoteVoiceSettingsAddLayerButton
source: Add Layer
ar_sa: إضافة طبقة
es_es: Añadir Capa
ko_kr: 레이어 추가
zh_cn: 添加层
zh_tw: 新增圖層

# NoteVoiceSettingsBrowseAddButton
source: Browse and Add...
ar_sa: استعراض وإضافة...
es_es: Explorar y Añadir...
ko_kr: 찾아보기 및 추가...
zh_cn: 浏览并添加...
zh_tw: 瀏覽並新增...

# NoteVoiceSettingsUpdateFileListTooltip
source: Update File List
ar_sa: تحديث قائمة الملفات
es_es: Actualizar Lista de Archivos
ko_kr: 파일 목록 업데이트
zh_cn: 更新文件列表
zh_tw: 更新檔案清單

# NoteVoiceSettingsMoveLayerUpTooltip
source: Move Up
ar_sa: تحريك لأعلى
es_es: Mover Arriba
ko_kr: 위로 이동
zh_cn: 上移
zh_tw: 上移

# NoteVoiceSettingsMoveLayerDownTooltip
source: Move Down
ar_sa: تحريك لأسفل
es_es: Mover Abajo
ko_kr: 아래로 이동
zh_cn: 下移
zh_tw: 下移

# NoteVoiceSettingsDeleteLayerTooltip
source: Delete
ar_sa: حذف
es_es: Eliminar
ko_kr: 삭제
zh_cn: 删除
zh_tw: 刪除

# NoteVoiceSettingsInternalSynthSettingsHeader
source: Internal Synthesizer Settings
ar_sa: إعدادات المركب الداخلي
es_es: Configuración del Sintetizador Interno
ko_kr: 내장 신디사이저 설정
zh_cn: 内置合成器设置
zh_tw: 內建合成器設定

# NoteVoiceSettingsDefaultWaveformLabel
source: Default Waveform
ar_sa: الشكل الموجي الافتراضي
es_es: Forma de Onda Predeterminada
ko_kr: 기본 파형
zh_cn: 默认波形
zh_tw: 預設波形

# NoteVoiceSettingsDefaultWaveformTooltip
source: This is the basic waveform for the timbre.
ar_sa: هذا هو الشكل الموجي الأساسي للجرس.
es_es: Esta es la forma de onda básica para el timbre.
ko_kr: 음색의 기본 파형입니다.
zh_cn: 音色的基本波形。
zh_tw: 音色的基本波形。

# NoteVoiceSettingsAttackLabel
source: Attack (s)
ar_sa: الهجوم (ث)
es_es: Ataque (s)
ko_kr: 어택 (초)
zh_cn: 起音 (秒)
zh_tw: 起音 (秒)

# NoteVoiceSettingsAttackTooltip
source: Time in seconds for the sound to reach maximum volume.
ar_sa: الوقت بالثواني لوصول الصوت إلى أقصى مستوى صوت.
es_es: Tiempo en segundos para que el sonido alcance el volumen máximo.
ko_kr: 소리가 최대 볼륨에 도달하는 시간(초).
zh_cn: 声音达到最大音量所需的时间（秒）。
zh_tw: 聲音達到最大音量所需的時間（秒）。

# NoteVoiceSettingsDecayLabel
source: Decay (s)
ar_sa: الاضمحلال (ث)
es_es: Decaimiento (s)
ko_kr: 디케이 (초)
zh_cn: 衰减 (秒)
zh_tw: 衰減 (秒)

# NoteVoiceSettingsDecayTooltip
source: Time in seconds to decay from maximum volume to sustain level.
ar_sa: الوقت بالثواني للانحلال من الحجم الأقصى إلى مستوى الاستدامة.
es_es: Tiempo en segundos para decaer desde el volumen máximo hasta el nivel de sostenido.
ko_kr: 최대 볼륨에서 서스테인 레벨까지 감쇠하는 시간(초).
zh_cn: 从最大音量衰减到持续音量所需的时间（秒）。
zh_tw: 從最大音量衰減到持續音量所需的時間（秒）。

# NoteVoiceSettingsSustainLabel
source: Sustain Level
ar_sa: مستوى الاستدامة
es_es: Nivel de Sostenido
ko_kr: 서스테인 레벨
zh_cn: 持续音量
zh_tw: 持續音量

# NoteVoiceSettingsSustainTooltip
source: Volume level while the sound persists (0-1).
ar_sa: مستوى الصوت أثناء استمرار الصوت (0-1).
es_es: Nivel de volumen mientras persiste el sonido (0-1).
ko_kr: 소리가 지속되는 동안의 볼륨 레벨(0-1).
zh_cn: 声音持续期间的音量级别 (0-1)。
zh_tw: 聲音持續期間的音量級別 (0-1)。

# NoteVoiceSettingsReleaseLabel
source: Release (s)
ar_sa: التحرير (ث)
es_es: Liberación (s)
ko_kr: 릴리스 (초)
zh_cn: 释放 (秒)
zh_tw: 釋放 (秒)

# NoteVoiceSettingsReleaseTooltip
source: Time in seconds for the sound to fade after the note is released.
ar_sa: الوقت بالثواني حتى يتلاشى الصوت بعد تحرير النوتة.
es_es: Tiempo en segundos para que el sonido se desvanezca después de soltar la nota.
ko_kr: 노트에서 손을 뗀 후 소리가 사라질 때까지의 시간(초).
zh_cn: 音符释放后声音消失所需的时间（秒）。
zh_tw: 音符釋放後聲音消失所需的時間（秒）。

# NoteVoiceSettingsBandlimitedSynthCheckbox
source: Bandlimited Synthesis (Reduce high-frequency noise)
ar_sa: تركيب محدود النطاق (تقليل ضوضاء التردد العالي)
es_es: Síntesis de Banda Limitada (Reduce el ruido de alta frecuencia)
ko_kr: 밴드리미티드 합성 (고주파 노이즈 감소)
zh_cn: 带限合成（减少高频噪声）
zh_tw: 帶限合成（減少高頻噪音）

# NoteVoiceSettingsBandlimitedSynthTooltip
source: Enabling reduces aliasing noise but slightly increases CPU load.
ar_sa: يؤدي التمكين إلى تقليل ضوضاء التعرج ولكنه يزيد قليلاً من حمل وحدة المعالجة المركزية.
es_es: Habilitarlo reduce el ruido de aliasing pero aumenta ligeramente la carga de la CPU.
ko_kr: 활성화하면 에일리어싱 노이즈를 줄이지만 CPU 부하가 약간 증가합니다.
zh_cn: 启用可减少混叠噪声，但会略微增加CPU负载。
zh_tw: 啟用可減少混疊噪音，但會略微增加CPU負載。

# NoteVoiceSettingsModelManagementTab
source: Model Management
ar_sa: إدارة النماذج
es_es: Gestión de Modelos
ko_kr: 모델 관리
zh_cn: 模型管理
zh_tw: 模型管理

# NoteVoiceSettingsModelManagementHeader
source: Voice Model Management
ar_sa: إدارة نماذج الصوت
es_es: Gestión de Modelos de Voz
ko_kr: 음원 모델 관리
zh_cn: 音源模型管理
zh_tw: 音源模型管理

# NoteVoiceSettingsRenameButton
source: Rename
ar_sa: إعادة تسمية
es_es: Renombrar
ko_kr: 이름 변경
zh_cn: 重命名
zh_tw: 重新命名

# NoteVoiceSettingsDeleteButton
source: Delete
ar_sa: حذف
es_es: Eliminar
ko_kr: 삭제
zh_cn: 删除
zh_tw: 刪除

# RenameModelWindowTitle
source: Rename Model
ar_sa: إعادة تسمية النموذج
es_es: Renombrar Modelo
ko_kr: 모델 이름 변경
zh_cn: 重命名模型
zh_tw: 重新命名模型

# NewModelNamePrompt
source: Enter the new model name:
ar_sa: أدخل اسم النموذج الجديد:
es_es: Introduzca el nuevo nombre del modelo:
ko_kr: 새 모델 이름을 입력하세요:
zh_cn: 请输入新的模型名称：
zh_tw: 請輸入新的模型名稱：

# ConfirmDeleteModelMessage
source: Delete model '{0}'?
ar_sa: هل تريد حذف النموذج '{0}'؟
es_es: ¿Eliminar modelo '{0}'?
ko_kr: 모델 '{0}'을(를) 삭제하시겠습니까?
zh_cn: 删除模型“{0}”？
zh_tw: 刪除模型「{0}」？

# DeleteConfirmationTitle
source: Confirm Deletion
ar_sa: تأكيد الحذف
es_es: Confirmar Eliminación
ko_kr: 삭제 확인
zh_cn: 确认删除
zh_tw: 確認刪除

# InvalidOrExistingModelNameError
source: Model name is invalid or already exists.
ar_sa: اسم النموذج غير صالح أو موجود بالفعل.
es_es: El nombre del modelo no es válido o ya existe.
ko_kr: 모델 이름이 잘못되었거나 이미 존재합니다.
zh_cn: 模型名称无效或已存在。
zh_tw: 模型名稱無效或已存在。

# ErrorTitle
source: Error
ar_sa: خطأ
ko_kr: 오류
zh_cn: 错误
zh_tw: 錯誤

# AudioTabHeader
source: Audio
ar_sa: الصوت
ko_kr: 오디오
zh_cn: 音频
zh_tw: 音訊

# PresetGroupHeader
source: Presets
ar_sa: الإعدادات المسبقة
es_es: Preajustes
ko_kr: 프리셋
zh_cn: 预设
zh_tw: 預設

# BasicSettingsGroupHeader
source: Basic Settings
ar_sa: الإعدادات الأساسية
es_es: Configuración Básica
ko_kr: 기본 설정
zh_cn: 基本设置
zh_tw: 基本設定

# SampleRateLabel
source: Sample Rate (Hz)
ar_sa: معدل العينة (هرتز)
es_es: Tasa de Muestreo (Hz)
ko_kr: 샘플 속도 (Hz)
zh_cn: 采样率 (Hz)
zh_tw: 取樣率 (Hz)

# SampleRateTooltip
source: The number of times audio is sampled per second. Higher values improve sound quality but increase CPU load. CD quality is 44100Hz.
ar_sa: عدد مرات أخذ عينات الصوت في الثانية. القيم الأعلى تحسن جودة الصوت ولكن تزيد من حمل وحدة المعالجة المركزية. جودة القرص المضغوط هي 44100 هرتز.
es_es: El número de veces que se muestrea el audio por segundo. Los valores más altos mejoran la calidad del sonido pero aumentan la carga de la CPU. La calidad de CD es de 44100 Hz.
ko_kr: 초당 오디오를 샘플링하는 횟수입니다. 값이 높을수록 음질이 향상되지만 CPU 부하도 증가합니다. CD 음질은 44100Hz입니다.
zh_cn: 每秒采样音频的次数。值越高，音质越好，但CPU负载也会增加。CD音质为44100Hz。
zh_tw: 每秒取樣音訊的次數。值越高，音質越好，但CPU負載也會增加。CD音質為44100Hz。

# MasterVolumeLabel
source: Master Volume
ar_sa: مستوى الصوت الرئيسي
es_es: Volumen Maestro
ko_kr: 마스터 볼륨
zh_cn: 主音量
zh_tw: 主音量

# MasterVolumeTooltip
source: Adjusts the master volume for the entire application. Set within the range of 0 (mute) to 1 (maximum).
ar_sa: يضبط مستوى الصوت الرئيسي للتطبيق بأكمله. قم بالتعيين ضمن النطاق من 0 (كتم الصوت) إلى 1 (الحد الأقصى).
es_es: Ajusta el volumen maestro para toda la aplicación. Establezca dentro del rango de 0 (silencio) a 1 (máximo).
ko_kr: 애플리케이션 전체의 마스터 볼륨을 조정합니다. 0(음소거)에서 1(최대) 범위 내에서 설정합니다.
zh_cn: 调整整个应用程序的主音量。设置范围为0（静音）到1（最大）。
zh_tw: 調整整個應用程式的主音量。設定範圍為0（靜音）到1（最大）。

# NormalizationGroupHeader
source: Normalization
ar_sa: التطبيع
es_es: Normalización
ko_kr: 정규화
zh_cn: 归一化
zh_tw: 標準化

# EnableNormalizationCheckbox
source: Enable Normalization
ar_sa: تمكين التطبيع
es_es: Habilitar Normalización
ko_kr: 정규화 활성화
zh_cn: 启用归一化
zh_tw: 啟用標準化

# EnableNormalizationTooltip
source: Automatically adjusts the volume to prevent clipping and equalize the overall volume.
ar_sa: يضبط مستوى الصوت تلقائيًا لمنع التقطيع وتوحيد مستوى الصوت العام.
es_es: Ajusta automáticamente el volumen para evitar el recorte y ecualizar el volumen general.
ko_kr: 볼륨을 자동으로 조정하여 클리핑을 방지하고 전체 볼륨을 균일하게 합니다.
zh_cn: 自动调整音量以防止削波并均衡整体音量。
zh_tw: 自動調整音量以防止削波並均衡整體音量。

# NormalizationThresholdLabel
source: Threshold
ar_sa: العتبة
es_es: Umbral
ko_kr: 임계값
zh_cn: 阈值
zh_tw: 閾值

# NormalizationThresholdTooltip
source: The volume threshold at which normalization activates. Normalization is applied when this value is exceeded.
ar_sa: عتبة مستوى الصوت التي يتم عندها تنشيط التطبيع. يتم تطبيق التطبيع عند تجاوز هذه القيمة.
es_es: El umbral de volumen al que se activa la normalización. La normalización se aplica cuando se supera este valor.
ko_kr: 정규화가 작동하는 볼륨 임계값입니다. 이 값을 초과하면 정규화가 적용됩니다.
zh_cn: 归一化激活的音量阈值。超过此值时应用归一化。
zh_tw: 標準化啟動的音量閾值。超過此值時套用標準化。

# NormalizationLevelLabel
source: Level
ar_sa: المستوى
es_es: Nivel
ko_kr: 레벨
zh_cn: 水平
zh_tw: 水準

# NormalizationLevelTooltip
source: The target volume level after normalization.
ar_sa: مستوى الصوت المستهدف بعد التطبيع.
es_es: El nivel de volumen objetivo después de la normalización.
ko_kr: 정규화 후 목표 볼륨 레벨입니다.
zh_cn: 归一化后的目标音量水平。
zh_tw: 標準化後的目標音量水準。

# GlobalFadeOutGroupHeader
source: Global Fade-Out
ar_sa: التلاشي التدريجي العام للخارج
es_es: Fundido de Salida Global
ko_kr: 글로벌 페이드 아웃
zh_cn: 全局淡出
zh_tw: 全域淡出

# EnableGlobalFadeOutCheckbox
source: Enable fade-out for final audio
ar_sa: تمكين التلاشي التدريجي للخارج للصوت النهائي
es_es: Habilitar fundido de salida para el audio final
ko_kr: 최종 오디오 페이드 아웃 활성화
zh_cn: 启用最终音频的淡出
zh_tw: 啟用最終音訊的淡出

# EnableGlobalFadeOutTooltip
source: Smoothly fades out the sound at the end of playback to prevent abrupt cutoffs.
ar_sa: يتلاشى الصوت تدريجيًا بسلاسة في نهاية التشغيل لمنع الانقطاعات المفاجئة.
es_es: Desvanece suavemente el sonido al final de la reproducción para evitar cortes abruptos.
ko_kr: 재생 종료 시 사운드를 부드럽게 페이드 아웃하여 갑작스러운 끊김을 방지합니다.
zh_cn: 在播放结束时平滑地淡出声音，以防止突然中断。
zh_tw: 在播放結束時平滑地淡出聲音，以防止突然中斷。

# FadeOutTimeLabel
source: Fade-out Time (s)
ar_sa: وقت التلاشي (ث)
es_es: Tiempo de Fundido (s)
ko_kr: 페이드 아웃 시간 (초)
zh_cn: 淡出时间 (秒)
zh_tw: 淡出時間 (秒)

# FadeOutTimeTooltip
source: The duration of the fade-out in seconds.
ar_sa: مدة التلاشي التدريجي للخارج بالثواني.
es_es: La duración del fundido de salida en segundos.
ko_kr: 페이드 아웃에 걸리는 시간(초)입니다.
zh_cn: 淡出持续时间（秒）。
zh_tw: 淡出持續時間（秒）。

# PresetSaveButton
source: Save
ar_sa: حفظ
es_es: Guardar
ko_kr: 저장
zh_cn: 保存
zh_tw: 儲存

# PresetDeleteButton
source: Delete
ar_sa: حذف
es_es: Eliminar
ko_kr: 삭제
zh_cn: 删除
zh_tw: 刪除

# PerformanceTabHeader
source: Performance
ar_sa: الأداء
es_es: Rendimiento
ko_kr: 성능
zh_cn: 性能
zh_tw: 效能

# RenderingSettingsGroupHeader
source: Rendering Settings
ar_sa: إعدادات العرض
es_es: Configuración de Renderizado
ko_kr: 렌더링 설정
zh_cn: 渲染设置
zh_tw: 渲染設定

# RenderingModeLabel
source: Rendering Mode
ar_sa: وضع العرض
es_es: Modo de Renderizado
ko_kr: 렌더링 모드
zh_cn: 渲染模式
zh_tw: 渲染模式

# RenderingModeTooltip
source: Selects the audio rendering method. Realtime mode has lower latency but may slightly reduce quality. GPU mode requires a compatible graphics card and may incur data transfer overhead.
ar_sa: يحدد طريقة عرض الصوت. وضع الوقت الفعلي له زمن انتقال أقل ولكنه قد يقلل الجودة قليلاً. يتطلب وضع GPU بطاقة رسومات متوافقة وقد يتسبب في زيادة حمل نقل البيانات.
es_es: Selecciona el método de renderizado de audio. El modo en tiempo real tiene menor latencia pero puede reducir ligeramente la calidad. El modo GPU requiere una tarjeta gráfica compatible y puede incurrir en sobrecarga de transferencia de datos.
ko_kr: 오디오 렌더링 방법을 선택합니다. 실시간 모드는 대기 시간이 짧지만 품질이 약간 저하될 수 있습니다. GPU 모드는 호환되는 그래픽 카드가 필요하며 데이터 전송 오버헤드가 발생할 수 있습니다.
zh_cn: 选择音频渲染方法。实时模式延迟较低，但质量可能略有下降。GPU模式需要兼容的显卡，并可能产生数据传输开销。
zh_tw: 選擇音訊渲染方法。即時模式延遲較低，但品質可能略有下降。GPU模式需要相容的顯示卡，並可能產生資料傳輸開銷。

# BasicSettingsGroupHeaderPerformance
source: Basic Settings
ar_sa: الإعدادات الأساسية
es_es: Configuración Básica
ko_kr: 기본 설정
zh_cn: 基本设置
zh_tw: 基本設定

# BufferSizeLabel
source: Buffer Size
ar_sa: حجم المخزن المؤقت
es_es: Tamaño del Búfer
ko_kr: 버퍼 크기
zh_cn: 缓冲区大小
zh_tw: 緩衝區大小

# BufferSizeTooltip
source: The number of audio samples processed at once. Smaller values reduce latency but increase CPU load and may cause dropouts.
ar_sa: عدد عينات الصوت التي تتم معالجتها مرة واحدة. تقلل القيم الأصغر من زمن الانتقال ولكنها تزيد من تحميل وحدة المعالج المركزية وقد تتسبب في انقطاع الصوت.
es_es: El número de muestras de audio procesadas a la vez. Los valores más pequeños reducen la latencia pero aumentan la carga de la CPU y pueden causar interrupciones.
ko_kr: 한 번에 처리되는 오디오 샘플 수입니다. 값이 작을수록 대기 시간이 줄어들지만 CPU 부하가 증가하고 끊김 현상이 발생할 수 있습니다.
zh_cn: 一次处理的音频样本数。值越小延迟越低，但CPU负载越高，可能导致音频中断。
zh_tw: 一次處理的音訊樣本數。值越小延遲越低，但CPU負載越高，可能導致音訊中斷。

# MaxPolyphonyLabel
source: Max Polyphony
ar_sa: أقصى عدد للأصوات المتزامنة
es_es: Polifonía Máxima
ko_kr: 최대 동시 발음 수
zh_cn: 最大复音数
zh_tw: 最大同時發聲數

# MaxPolyphonyTooltip
source: The maximum number of notes that can be played simultaneously. Exceeding this value may cause older notes to stop sounding.
ar_sa: أقصى عدد للنوتات التي يمكن تشغيلها في نفس الوقت. قد يؤدي تجاوز هذه القيمة إلى توقف النوتات الأقدم عن الصوت.
es_es: El número máximo de notas que se pueden reproducir simultáneamente. Superar este valor puede hacer que las notas más antiguas dejen de sonar.
ko_kr: 동시에 재생할 수 있는 최대 노트 수입니다. 이 값을 초과하면 오래된 노트 소리가 멈출 수 있습니다.
zh_cn: 可同时播放的最大音符数。超过此值可能会导致较早的音符停止发声。
zh_tw: 可同時播放的最大音符數。超過此值可能會導致較早的音符停止發聲。

# MaxThreadsLabel
source: Max Threads
ar_sa: أقصى عدد للخيوط
es_es: Máximo de Hilos
ko_kr: 최대 스레드 수
zh_cn: 最大线程数
zh_tw: 最大執行緒數

# MaxThreadsTooltip
source: The maximum number of CPU threads used for audio processing. Typically
ar_sa: El número máximo de hilos de CPU utilizados para el procesamiento de audio. Normalmente
es_es: 오디오 처리에 사용되는 최대 CPU 스레드 수입니다. 일반적으로 CPU 코어 수와 일치시키는 것이 효과적입니다.
id_id: es efectivo igualar esto al número de núcleos de la CPU.
ko_kr: 用於音訊處理的最大CPU執行緒數。通常，將其設定為CPU核心數效果最佳。
zh_cn: matching this to the number of CPU cores is effective.
zh_tw: 用于音频处理的最大CPU线程数。通常，将其设置为CPU核心数效果最佳。

# InitialSyncDurationLabel
source: Initial Load Time (s)
ar_sa: وقت التحميل الأولي (ث)
es_es: Tiempo de Carga Inicial (s)
ko_kr: 초기 로딩 시간 (초)
zh_cn: 初始加载时间 (秒)
zh_tw: 初始載入時間 (秒)

# InitialSyncDurationTooltip
source: The playback duration (in seconds) loaded synchronously when the file is opened. Longer times increase initial wait but reduce processing during playback.
ar_sa: مدة التشغيل (بالثواني) التي يتم تحميلها بشكل متزامن عند فتح الملف. تزيد الأوقات الأطول من الانتظار الأولي ولكنها تقلل المعالجة أثناء التشغيل.
es_es: La duración de la reproducción (en segundos) cargada sincrónicamente al abrir el archivo. Tiempos más largos aumentan la espera inicial pero reducen el procesamiento durante la reproducción.
ko_kr: 파일 로드 시 동기적으로 로드되는 재생 시간(초)입니다. 시간이 길수록 초기 대기 시간이 길어지지만 재생 중 처리 부하가 줄어듭니다.
zh_cn: 文件加载时同步加载的播放时长（秒）。时间越长，初始等待时间越长，但会减少播放期间的处理。
zh_tw: 檔案載入時同步載入的播放時長（秒）。時間越長，初始等待時間越長，但會減少播放期間的處理。

# GpuAccelerationGroupHeader
source: GPU Acceleration (Experimental)
ar_sa: تسريع GPU (تجريبي)
es_es: Aceleración de GPU (Experimental)
ko_kr: GPU 가속 (실험적)
zh_cn: GPU加速 (实验性)
zh_tw: GPU加速 (實驗性)

# GpuAccelerationTooltip
source: Experimental feature. Uses the GPU to accelerate parts of the audio processing. Requires a compatible graphics card.
ar_sa: ميزة تجريبية. تستخدم وحدة معالجة الرسومات لتسريع أجزاء من معالجة الصوت. يتطلب بطاقة رسومات متوافقة.
es_es: Función experimental. Utiliza la GPU para acelerar partes del procesamiento de audio. Requiere una tarjeta gráfica compatible.
ko_kr: 실험적인 기능입니다. GPU를 사용하여 오디오 처리 일부를 가속화합니다. 호환되는 그래픽 카드가 필요합니다.
zh_cn: 实验性功能。使用GPU加速部分音频处理。需要兼容的显卡。
zh_tw: 實驗性功能。使用GPU加速部分音訊處理。需要相容的顯示卡。

# InitializeGpuOnStartupCheckbox
source: Initialize GPU device on startup
ar_sa: تهيئة جهاز GPU عند بدء التشغيل
es_es: Inicializar dispositivo GPU al inicio
ko_kr: 시작 시 GPU 장치 초기화
zh_cn: 启动时初始化GPU设备
zh_tw: 啟動時初始化GPU裝置

# InitializeGpuOnStartupTooltip
source: If enabled
ar_sa: 如果啟用，則在YMM4啟動時初始化GPU裝置。如果禁用，則在首次載入MIDI檔案時進行初始化，這可能需要更長時間。
es_es: 如果启用，则在YMM4启动时初始化GPU设备。如果禁用，则在首次加载MIDI文件时进行初始化，这可能需要更长时间。
id_id: 활성화된 경우 YMM4 시작 시 GPU 장치를 초기화합니다. 비활성화된 경우 첫 번째 MIDI 파일 로드 시 초기화가 수행되므로 로드 시간이 더 걸릴 수 있습니다.
ko_kr: which may take longer.
zh_cn: initializes the GPU device when YMM4 starts. If disabled
zh_tw: initialization occurs on the first MIDI file load

# GpuSynthesisCheckbox
source: Synthesis
ar_sa: التركيب
es_es: Síntesis
ko_kr: 신디사이저
zh_cn: 合成
zh_tw: 合成

# GpuSynthesisTooltip
source: Uses the GPU for waveform synthesis processing.
ar_sa: يستخدم وحدة معالجة الرسومات لمعالجة تركيب شكل الموجة.
es_es: Utiliza la GPU para el procesamiento de síntesis de formas de onda.
ko_kr: GPU를 사용하여 파형 합성 처리를 수행합니다.
zh_cn: 使用GPU进行波形合成处理。
zh_tw: 使用GPU進行波形合成處理。

# GpuEqualizerCheckbox
source: Equalizer
ar_sa: المعادل
es_es: Ecualizador
ko_kr: 이퀄라이저
zh_cn: 均衡器
zh_tw: 等化器

# GpuEqualizerTooltip
source: Uses the GPU for equalizer processing.
ar_sa: يستخدم وحدة معالجة الرسومات لمعالجة المعادل.
es_es: Utiliza la GPU para el procesamiento del ecualizador.
ko_kr: GPU를 사용하여 이퀄라이저 처리를 수행합니다.
zh_cn: 使用GPU进行均衡器处理。
zh_tw: 使用GPU進行等化器處理。

# GpuEffectsChainCheckbox
source: Effects Chain
ar_sa: سلسلة التأثيرات
es_es: Cadena de Efectos
ko_kr: 이펙트 체인
zh_cn: 效果链
zh_tw: 效果鏈

# GpuEffectsChainTooltip
source: Uses the GPU to process multiple effects (reverb
ar_sa: GPU를 사용하여 여러 이펙트(리버브
es_es: 使用GPU統一處理多個效果（混響、壓縮等）。
id_id: 컴프레션 등)를 함께 처리합니다.
ko_kr: 使用GPU统一处理多个效果（混响、压缩等）。
zh_cn: compression
zh_tw: etc.) together.

# GpuConvolutionReverbCheckbox
source: Convolution Reverb
ar_sa: صدى الالتفاف
es_es: Reverberación de Convolución
ko_kr: 컨볼루션 리버브
zh_cn: 卷积混响
zh_tw: 摺積混響

# GpuConvolutionReverbTooltip
source: Uses the GPU to process high-quality convolution reverb.
ar_sa: يستخدم وحدة معالجة الرسومات لمعالجة صدى الالتفاف عالي الجودة.
es_es: Utiliza la GPU para procesar reverberación de convolución de alta calidad.
ko_kr: GPU를 사용하여 고품질 컨볼루션 리버브를 처리합니다.
zh_cn: 使用GPU处理高质量卷积混响。
zh_tw: 使用GPU處理高品質摺積混響。

# EnableParallelProcessingCheckbox
source: Enable Parallel Processing (CPU)
ar_sa: تمكين المعالجة المتوازية (CPU)
es_es: Habilitar Procesamiento Paralelo (CPU)
ko_kr: 병렬 처리 활성화 (CPU)
zh_cn: 启用并行处理 (CPU)
zh_tw: 啟用並行處理 (CPU)

# EnableParallelProcessingTooltip
source: Utilizes CPU multi-cores to execute audio processing per channel in parallel
ar_sa: Utiliza los múltiples núcleos de la CPU para ejecutar el procesamiento de audio por canal en paralelo
es_es: CPU 멀티 코어를 활용하여 채널별 오디오 처리를 병렬로 실행하여 렌더링 속도를 높입니다.
id_id: acelerando el renderizado.
ko_kr: 利用CPU多核心並行執行每個通道的音訊處理，以加快渲染速度。
zh_cn: speeding up rendering.
zh_tw: 利用CPU多核并行执行每个通道的音频处理，以加快渲染速度。

# PlaybackSettingsGroupHeader
source: Playback Settings
ar_sa: إعدادات التشغيل
es_es: Configuración de Reproducción
ko_kr: 재생 설정
zh_cn: 播放设置
zh_tw: 播放設定

# DefaultTempoLabel
source: Default Tempo
ar_sa: السرعة الافتراضية
es_es: Tempo Predeterminado
ko_kr: 기본 템포
zh_cn: 默认速度
zh_tw: 預設速度

# DefaultTempoTooltip
source: The default tempo used if the MIDI file does not contain tempo information. Specified in microseconds per quarter note (e.g., 120BPM = 500000).
ar_sa: الإيقاع الافتراضي المستخدم إذا لم يحتوي ملف MIDI على معلومات الإيقاع. محدد بالميكروثانية لكل نغمة ربعية (على سبيل المثال ، 120 نبضة في الدقيقة = 500000).
es_es: El tempo predeterminado utilizado si el archivo MIDI no contiene información de tempo. Especificado en microsegundos por negra (p. ej., 120 BPM = 500000).
ko_kr: MIDI 파일에 템포 정보가 없는 경우 사용되는 기본 템포입니다. 마이크로초/4분음표 단위로 지정합니다(예: 120BPM = 500000).
zh_cn: MIDI 文件不包含速度信息时使用的默认速度。以微秒/四分音符指定（例如：120BPM = 500000）。
zh_tw: MIDI 檔案不包含速度資訊時使用的預設速度。以微秒/四分音符指定（例如：120BPM = 500000）。

# PitchBendRangeLabel
source: Pitch Bend Range
ar_sa: مدى انحناء درجة الصوت
es_es: Rango de Inflexión de Tono
ko_kr: 피치 벤드 범위
zh_cn: 弯音范围
zh_tw: 滑音範圍

# PitchBendRangeTooltip
source: Sets the range of pitch bend in semitones. For example, setting it to 2 allows pitch bending within a range of ±2 semitones.
ar_sa: يضبط نطاق انحناء درجة الصوت بأنصاف النغمات. على سبيل المثال ، يؤدي تعيينه إلى 2 إلى السماح بانحناء درجة الصوت ضمن نطاق ± 2 نصف نغمة.
es_es: Establece el rango de inflexión de tono en semitonos. Por ejemplo, establecerlo en 2 permite la inflexión de tono dentro de un rango de ±2 semitonos.
ko_kr: 피치 벤드 범위를 반음 단위로 설정합니다. 예를 들어 2로 설정하면 ±2 반음 범위 내에서 피치가 변합니다.
zh_cn: 设置弯音范围（以半音为单位）。例如，设置为2允许在±2半音范围内弯音。
zh_tw: 設定滑音範圍（以半音為單位）。例如，設定為2允許在±2半音範圍內滑音。

# MinVelocityLabel
source: Min Velocity
ar_sa: أدنى سرعة
es_es: Velocidad Mínima
ko_kr: 최소 벨로시티
zh_cn: 最小力度
zh_tw: 最小力度

# MinVelocityTooltip
source: The minimum velocity for notes to be processed. Notes with lower velocity will be ignored. Useful for removing unwanted low-volume notes.
ar_sa: أدنى سرعة للنوتات المراد معالجتها. سيتم تجاهل النوتات ذات السرعة الأقل. مفيد لإزالة النوتات غير المرغوب فيها ذات مستوى الصوت المنخفض.
es_es: La velocidad mínima para procesar las notas. Las notas con menor velocidad serán ignoradas. Útil para eliminar notas no deseadas de bajo volumen.
ko_kr: 처리할 노트의 최소 벨로시티입니다. 이보다 낮은 벨로시티의 노트는 무시됩니다. 원치 않는 작은 볼륨의 노트를 제거하는 데 유용합니다.
zh_cn: 处理音符的最小力度。力度低于此值的音符将被忽略。有助于移除不需要的低音量音符。
zh_tw: 處理音符的最小力度。力度低於此值的音符將被忽略。有助於移除不需要的低音量音符。

# ProcessingSettingsGroupHeader
source: Processing Settings
ar_sa: إعدادات المعالجة
es_es: Configuración de Procesamiento
ko_kr: 처리 설정
zh_cn: 处理设置
zh_tw: 處理設定

# ProcessControlChangesCheckbox
source: Process Control Changes
ar_sa: معالجة تغييرات التحكم
es_es: Procesar Cambios de Control
ko_kr: 컨트롤 체인지 처리
zh_cn: 处理控制变更
zh_tw: 處理控制變更
