Repository: routersys/YMM4-MIDI
Catalog: MIDI/Localization/Translate.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# ProcessControlChangesTooltip
source: Processes Control Change messages such as volume and pan.
ar_sa: معالجة رسائل تغيير التحكم مثل مستوى الصوت والتحريك.
es_es: Procesa mensajes de Cambio de Control como volumen y panorama.
ko_kr: 볼륨 및 팬과 같은 컨트롤 체인지 메시지를 처리합니다.
zh_cn: 处理控制变更消息，例如音量和声相。
zh_tw: 處理控制變更訊息，例如音量和聲相。

# ProcessPitchBendCheckbox
source: Process Pitch Bend
ar_sa: معالجة انحناء درجة الصوت
es_es: Procesar Inflexión de Tono
ko_kr: 피치 벤드 처리
zh_cn: 处理弯音
zh_tw: 處理滑音

# ProcessPitchBendTooltip
source: Processes Pitch Bend messages to smoothly change the pitch.
ar_sa: معالجة رسائل انحناء درجة الصوت لتغيير درجة الصوت بسلاسة.
es_es: Procesa mensajes de Inflexión de Tono para cambiar suavemente el tono.
ko_kr: 피치 벤드 메시지를 처리하여 피치를 부드럽게 변경합니다.
zh_cn: 处理弯音消息以平滑地改变音高。
zh_tw: 處理滑音訊息以平滑地改變音高。

# ProcessProgramChangesCheckbox
source: Process Program Changes
ar_sa: معالجة تغييرات البرنامج
es_es: Procesar Cambios de Programa
ko_kr: 프로그램 체인지 처리
zh_cn: 处理程序变更
zh_tw: 處理音色變更

# ProcessProgramChangesTooltip
source: Processes Program Change messages to switch instrument sounds.
ar_sa: معالجة رسائل تغيير البرنامج لتبديل أصوات الآلات.
es_es: Procesa mensajes de Cambio de Programa para cambiar los sonidos de los instrumentos.
ko_kr: 악기 소리를 전환하는 프로그램 체인지 메시지를 처리합니다.
zh_cn: 处理程序变更消息以切换乐器声音。
zh_tw: 處理音色變更訊息以切換樂器聲音。

# ExclusionSettingsGroupHeader
source: Exclusion Settings
ar_sa: إعدادات الاستبعاد
es_es: Configuración de Exclusión
ko_kr: 제외 설정
zh_cn: 排除设置
zh_tw: 排除設定

# ExcludedChannelsLabel
source: Excluded Channels (comma separated)
ar_sa: القنوات المستبعدة (مفصولة بفواصل)
es_es: Canales Excluidos (separados por coma)
ko_kr: 제외 채널 (쉼표 구분)
zh_cn: 排除通道 (逗号分隔)
zh_tw: 排除頻道 (逗號分隔)

# ExcludedChannelsTooltip
source: MIDI channels specified here will be ignored during playback (comma separated).
ar_sa: سيتم تجاهل قنوات MIDI المحددة هنا أثناء التشغيل (مفصولة بفواصل).
es_es: Los canales MIDI especificados aquí serán ignorados durante la reproducción (separados por coma).
ko_kr: 여기에 지정된 MIDI 채널은 재생 중에 무시됩니다(쉼표 구분).
zh_cn: 此处指定的MIDI通道将在播放时被忽略（逗号分隔）。
zh_tw: 此處指定的MIDI頻道將在播放時被忽略（逗號分隔）。

# ExcludedTracksLabel
source: Excluded Tracks (comma separated)
ar_sa: المسارات المستبعدة (مفصولة بفواصل)
es_es: Pistas Excluidas (separadas por coma)
ko_kr: 제외 트랙 (쉼표 구분)
zh_cn: 排除轨道 (逗号分隔)
zh_tw: 排除音軌 (逗號分隔)

# ExcludedTracksTooltip
source: Tracks specified here will be ignored during playback (comma separated).
ar_sa: سيتم تجاهل المسارات المحددة هنا أثناء التشغيل (مفصولة بفواصل).
es_es: Las pistas especificadas aquí serán ignoradas durante la reproducción (separadas por coma).
ko_kr: 여기에 지정된 트랙은 재생 중에 무시됩니다(쉼표 구분).
zh_cn: 此处指定的轨道将在播放时被忽略（逗号分隔）。
zh_tw: 此處指定的音軌將在播放時被忽略（逗號分隔）。

# EnableSfzCheckbox
source: Enable SFZ (Prioritized over SoundFont)
ar_sa: تمكين SFZ (الأولوية على SoundFont)
es_es: Habilitar SFZ (Priorizado sobre SoundFont)
ko_kr: SFZ 활성화 (SoundFont보다 우선 적용)
zh_cn: 启用SFZ (优先于SoundFont)
zh_tw: 啟用SFZ (優先於SoundFont)

# EnableSfzTooltip
source: Plays MIDI using SFZ format sampler instruments. If enabled
ar_sa: Reproduce MIDI utilizando instrumentos de sampler en formato SFZ. Si está habilitado
es_es: SFZ 형식 샘플러 악기를 사용하여 MIDI를 재생합니다. 활성화된 경우 SoundFont보다 우선 적용됩니다.
id_id: tiene prioridad sobre SoundFont.
ko_kr: 使用SFZ格式的取樣器音源播放MIDI。如果啟用，則優先於SoundFont。
zh_cn: takes precedence over SoundFont.
zh_tw: 使用SFZ格式的采样器音源播放MIDI。如果启用，则优先于SoundFont。

# SfzSettingsGroupHeader
source: Settings (Double-click to edit)
ar_sa: الإعدادات (انقر نقرًا مزدوجًا للتحرير)
es_es: Configuración (Doble clic para editar)
ko_kr: 설정 (더블 클릭하여 편집)
zh_cn: 设置 (双击编辑)
zh_tw: 設定 (按兩下編輯)

# SfzSearchPathLabel
source: SFZ Search Folder:
ar_sa: مجلد البحث عن SFZ:
es_es: Carpeta de Búsqueda SFZ:
ko_kr: SFZ 검색 폴더:
zh_cn: SFZ 搜索文件夹：
zh_tw: SFZ 搜尋資料夾：

# SfzSearchPathTooltip
source: Specify the path to the folder to search for SFZ files.
ar_sa: حدد مسار المجلد للبحث عن ملفات SFZ.
es_es: Especifique la ruta a la carpeta para buscar archivos SFZ.
ko_kr: SFZ 파일을 검색할 폴더 경로를 지정합니다.
zh_cn: 指定搜索SFZ文件的文件夹路径。
zh_tw: 指定搜尋SFZ檔案的資料夾路徑。

# SfzListStatusHeader
source: Status
ar_sa: الحالة
es_es: Estado
ko_kr: 상태
zh_cn: 状态
zh_tw: 狀態

# SfzListFilePathHeader
source: SFZ File Path
ar_sa: مسار ملف SFZ
es_es: Ruta del Archivo SFZ
ko_kr: SFZ 파일 경로
zh_cn: SFZ 文件路径
zh_tw: SFZ 檔案路徑

# SfzListProgramNumberHeader
source: Program Number
ar_sa: رقم البرنامج
es_es: Número de Programa
ko_kr: 프로그램 번호
zh_cn: 程序号
zh_tw: 程式編號

# EnableSoundFontCheckbox
source: Enable SoundFont
ar_sa: تمكين SoundFont
es_es: Habilitar SoundFont
ko_kr: SoundFont 활성화
zh_cn: 启用SoundFont
zh_tw: 啟用SoundFont

# EnableSoundFontTooltip
source: Plays MIDI using SoundFont (.sf2) files.
ar_sa: تشغيل MIDI باستخدام ملفات SoundFont (.sf2).
es_es: Reproduce MIDI utilizando archivos SoundFont (.sf2).
ko_kr: SoundFont (.sf2) 파일을 사용하여 MIDI를 재생합니다.
zh_cn: 使用SoundFont (.sf2) 文件播放MIDI。
zh_tw: 使用SoundFont (.sf2) 檔案播放MIDI。

# SoundFontBasicSettingsGroupHeader
source: Basic Settings
ar_sa: الإعدادات الأساسية
es_es: Configuración Básica
ko_kr: 기본 설정
zh_cn: 基本设置
zh_tw: 基本設定

# UseDefaultSoundFontCheckbox
source: Use default SoundFont
ar_sa: استخدام SoundFont الافتراضي
es_es: Usar SoundFont predeterminado
ko_kr: 기본 SoundFont 사용
zh_cn: 使用默认SoundFont
zh_tw: 使用預設SoundFont

# UseDefaultSoundFontTooltip
source: Uses the default SoundFont (GeneralUser-GS.sf2) included with the plugin.
ar_sa: يستخدم SoundFont الافتراضي (GeneralUser-GS.sf2) المضمن مع المكون الإضافي.
es_es: Utiliza el SoundFont predeterminado (GeneralUser-GS.sf2) incluido con el complemento.
ko_kr: 플러그인에 포함된 기본 SoundFont(GeneralUser-GS.sf2)를 사용합니다.
zh_cn: 使用插件附带的默认SoundFont (GeneralUser-GS.sf2)。
zh_tw: 使用外掛程式附帶的預設SoundFont (GeneralUser-GS.sf2)。

# FallbackToSynthesisCheckbox
source: Fallback to synthesis if SoundFont is not found
ar_sa: الرجوع إلى التوليف إذا لم يتم العثور على SoundFont
es_es: Retroceder a la síntesis si no se encuentra SoundFont
ko_kr: SoundFont가 없는 경우 신디사이저로 대체
zh_cn: 如果找不到SoundFont，则回退到合成
zh_tw: 如果找不到SoundFont，則回退到合成

# FallbackToSynthesisTooltip
source: Switches to playback with the built-in synthesizer if a suitable SoundFont is not found.
ar_sa: التبديل إلى التشغيل باستخدام المركب المدمج إذا لم يتم العثور على SoundFont مناسب.
es_es: Cambia a la reproducción con el sintetizador incorporado si no se encuentra un SoundFont adecuado.
ko_kr: 적절한 SoundFont를 찾을 수 없는 경우 내장 신디사이저로 재생하도록 전환합니다.
zh_cn: 如果找不到合适的SoundFont，则切换到使用内置合成器播放。
zh_tw: 如果找不到合適的SoundFont，則切換到使用內建合成器播放。

# SoundFontDirectoryLabel
source: SoundFont Directory
ar_sa: دليل SoundFont
es_es: Directorio de SoundFont
ko_kr: SoundFont 디렉토리
zh_cn: SoundFont 目录
zh_tw: SoundFont 目錄

# SoundFontDirectoryTooltip
source: The path to the directory containing user-added SoundFont files.
ar_sa: المسار إلى الدليل الذي يحتوي على ملفات SoundFont التي أضافها المستخدم.
es_es: La ruta al directorio que contiene los archivos SoundFont agregados por el usuario.
ko_kr: 사용자가 추가한 SoundFont 파일을 포함하는 디렉토리 경로입니다.
zh_cn: 包含用户添加的SoundFont文件的目录路径。
zh_tw: 包含使用者新增的SoundFont檔案的目錄路徑。

# PreferredSoundFontLabel
source: Preferred SoundFont Filename
ar_sa: اسم ملف SoundFont المفضل
es_es: Nombre de Archivo SoundFont Preferido
ko_kr: 선호하는 SoundFont 파일 이름
zh_cn: 首选SoundFont文件名
zh_tw: 偏好的SoundFont檔案名

# PreferredSoundFontTooltip
source: Specify the SoundFont filename to prioritize even if it doesn't match the rules.
ar_sa: حدد اسم ملف SoundFont لإعطائه الأولوية حتى لو لم يتطابق مع القواعد.
es_es: Especifique el nombre de archivo SoundFont para priorizar incluso si no coincide con las reglas.
ko_kr: 규칙과 일치하지 않더라도 우선적으로 사용할 SoundFont 파일 이름을 지정합니다.
zh_cn: 指定即使不符合规则也要优先使用的SoundFont文件名。
zh_tw: 指定即使不符合規則也要優先使用的SoundFont檔案名。

# SoundFontLayersGroupHeader
source: SoundFont Layers (Used stacked, prioritized from top)
ar_sa: Capas de SoundFont (Usadas apiladas
es_es: 위에서부터 우선 적용)
id_id: priorizadas desde arriba)
ko_kr: SoundFont 레이어 (겹쳐 사용
zh_cn: SoundFont 层 (堆叠使用，从上到下优先)
zh_tw: SoundFont 圖層 (堆疊使用，由上至下優先)

# LayerUpButtonTooltip
source: Moves the layer up.
ar_sa: تحريك الطبقة لأعلى.
es_es: Mueve la capa hacia arriba.
ko_kr: 레이어를 위로 이동합니다.
zh_cn: 将层向上移动。
zh_tw: 將圖層向上移動。

# LayerDownButtonTooltip
source: Moves the layer down.
ar_sa: تحريك الطبقة لأسفل.
es_es: Mueve la capa hacia abajo.
ko_kr: 레이어를 아래로 이동합니다.
zh_cn: 将层向下移动。
zh_tw: 將圖層向下移動。

# RemoveLayerButtonTooltip
source: Removes the selected layer.
ar_sa: إزالة الطبقة المحددة.
es_es: Elimina la capa seleccionada.
ko_kr: 선택한 레이어를 제거합니다.
zh_cn: 移除选定的层。
zh_tw: 移除選定的圖層。

# AddLayerButton
source: Add to Layer
ar_sa: إضافة إلى طبقة
es_es: Añadir a Capa
ko_kr: 레이어에 추가
zh_cn: 添加到层
zh_tw: 新增至圖層

# SoundFontListGroupHeader
source: Available SoundFonts and Rules (Double-click to edit)
ar_sa: ملفات SoundFont والقواعد المتاحة (انقر نقرًا مزدوجًا للتحرير)
es_es: SoundFonts y Reglas Disponibles (Doble clic para editar)
ko_kr: 사용 가능한 SoundFont 및 규칙 (더블 클릭하여 편집)
zh_cn: 可用SoundFont和规则 (双击编辑)
zh_tw: 可用的SoundFont和規則 (按兩下編輯)

# SoundFontListStatusHeader
source: Status
ar_sa: الحالة
es_es: Estado
ko_kr: 상태
zh_cn: 状态
zh_tw: 狀態

# SoundFontListFileNameHeader
source: SoundFont File
ar_sa: ملف SoundFont
es_es: Archivo SoundFont
ko_kr: SoundFont 파일
zh_cn: SoundFont 文件
zh_tw: SoundFont 檔案

# SoundFontListMinDurationHeader
source: Min Duration(s)
ar_sa: الحد الأدنى للمدة (ث)
es_es: Duración Mín.(s)
ko_kr: 최소 시간(초)
zh_cn: 最短时间(秒)
zh_tw: 最短時間(秒)

# SoundFontListMaxDurationHeader
source: Max Duration(s)
ar_sa: الحد الأقصى للمدة (ث)
es_es: Duración Máx.(s)
ko_kr: 최대 시간(초)
zh_cn: 最长时间(秒)
zh_tw: 最長時間(秒)

# SoundFontListMinTracksHeader
source: Min Tracks
ar_sa: الحد الأدنى للمسارات
es_es: Pistas Mín.
ko_kr: 최소 트랙
zh_cn: 最小轨道
zh_tw: 最小音軌

# SoundFontListMaxTracksHeader
source: Max Tracks
ar_sa: الحد الأقصى للمسارات
es_es: Pistas Máx.
ko_kr: 최대 트랙
zh_cn: 最大轨道
zh_tw: 最大音軌

# SoundFontListRequiredProgramsHeader
source: Required Programs
ar_sa: البرامج المطلوبة
es_es: Programas Requeridos
ko_kr: 필수 프로그램
zh_cn: 必需程序
zh_tw: 必需程式

# SynthesisTabHeader
source: Synthesis
ar_sa: التركيب
es_es: Síntesis
ko_kr: 신디사이저
zh_cn: 合成
zh_tw: 合成

# SynthesisBasicSettingsGroupHeader
source: Basic Settings
ar_sa: الإعدادات الأساسية
es_es: Configuración Básica
ko_kr: 기본 설정
zh_cn: 基本设置
zh_tw: 基本設定

# DefaultWaveformLabel
source: Default Waveform
ar_sa: الشكل الموجي الافتراضي
es_es: Forma de Onda Predeterminada
ko_kr: 기본 파형
zh_cn: 默认波形
zh_tw: 預設波形

# DefaultWaveformTooltip
source: Select the basic waveform type for the timbre.
ar_sa: حدد نوع الشكل الموجي الأساسي للجرس.
es_es: Seleccione el tipo de forma de onda básica para el timbre.
ko_kr: 음색의 기본 파형 유형을 선택합니다.
zh_cn: 选择音色的基本波形类型。
zh_tw: 選擇音色的基本波形類型。

# WavetableDirectoryLabel
source: Wavetable Folder
ar_sa: مجلد Wavetable
es_es: Carpeta Wavetable
ko_kr: Wavetable 폴더
zh_cn: Wavetable 文件夹
zh_tw: Wavetable 資料夾

# WavetableDirectoryTooltip
source: Folder to place user-defined WAV files.
ar_sa: المجلد لوضع ملفات WAV المعرفة من قبل المستخدم.
es_es: Carpeta para colocar archivos WAV definidos por el usuario.
ko_kr: 사용자 정의 WAV 파일을 배치할 폴더입니다.
zh_cn: 放置用户定义的WAV文件的文件夹。
zh_tw: 放置使用者定義的WAV檔案的資料夾。

# A4FrequencyLabel
source: A4 Frequency (Hz)
ar_sa: تردد A4 (هرتز)
es_es: Frecuencia A4 (Hz)
ko_kr: A4 주파수 (Hz)
zh_cn: A4 频率 (Hz)
zh_tw: A4 頻率 (Hz)

# A4FrequencyTooltip
source: Sets the frequency of the reference note A4 (La). The modern standard is 440Hz
ar_sa: 기준음 A4(라)의 주파수를 설정합니다. 현대 표준은 440Hz이지만 고음악 등에서는 다른 값이 사용됩니다.
es_es: 設定參考音A4（La）的頻率。現代標準為440Hz，但在古樂等領域會使用不同的值。
id_id: Establece la frecuencia de la nota de referencia A4 (La). El estándar moderno es 440 Hz
ko_kr: 设置参考音A4（La）的频率。现代标准为440Hz，但在古乐等领域会使用不同的值。
zh_cn: but different values are used in early music
zh_tw: etc.

# MinFrequencyLabel
source: Min Frequency (Hz)
ar_sa: أدنى تردد (هرتز)
es_es: Frecuencia Mínima (Hz)
ko_kr: 최소 주파수 (Hz)
zh_cn: 最小频率 (Hz)
zh_tw: 最小頻率 (Hz)

# MinFrequencyTooltip
source: The lower limit of the frequency of the generated audio. Frequencies below this will be clipped.
ar_sa: الحد الأدنى لتردد الصوت الذي تم إنشاؤه. سيتم قص الترددات التي تقل عن هذا.
es_es: El límite inferior de la frecuencia del audio generado. Las frecuencias por debajo de este límite serán recortadas.
ko_kr: 생성되는 오디오 주파수의 하한입니다. 이보다 낮은 주파수는 클리핑됩니다.
zh_cn: 生成音频频率的下限。低于此频率将被削波。
zh_tw: 生成音訊頻率的下限。低於此頻率將被削波。

# MaxFrequencyLabel
source: Max Frequency (Hz)
ar_sa: أقصى تردد (هرتز)
es_es: Frecuencia Máxima (Hz)
ko_kr: 최대 주파수 (Hz)
zh_cn: 最大频率 (Hz)
zh_tw: 最大頻率 (Hz)

# MaxFrequencyTooltip
source: The upper limit of the frequency of the generated audio. Frequencies above this will be clipped.
ar_sa: الحد الأعلى لتردد الصوت الذي تم إنشاؤه. سيتم قص الترددات التي تزيد عن هذا.
es_es: El límite superior de la frecuencia del audio generado. Las frecuencias por encima de este límite serán recortadas.
ko_kr: 생성되는 오디오 주파수의 상한입니다. 이보다 높은 주파수는 클리핑됩니다.
zh_cn: 生成音频频率的上限。高于此频率将被削波。
zh_tw: 生成音訊頻率的上限。高於此頻率將被削波。

# EnvelopeScaleLabel
source: Envelope Scale
ar_sa: مقياس المغلف
es_es: Escala de Envolvente
ko_kr: 엔벨로프 스케일
zh_cn: 包络比例
zh_tw: 波封比例

# EnvelopeScaleTooltip
source: Adjusts the time scale of the ADSR envelope (attack
ar_sa: 调整ADSR包络（起音、衰减、持续、释放）的时间刻度。大于1的值使其更长，小于1的值使其更短。
es_es: smaller values make it shorter.
id_id: 調整ADSR波封（起音、衰減、持續、釋放）的時間刻度。大於1的值使其更長，小於1的值使其更短。
ko_kr: release). Values greater than 1 make it longer
zh_cn: decay
zh_tw: sustain

# DefaultEnvelopeGroupHeader
source: Default Envelope
ar_sa: المغلف الافتراضي
es_es: Envolvente Predeterminada
ko_kr: 기본 엔벨로프
zh_cn: 默认包络
zh_tw: 預設波封

# DefaultEnvelopeTooltip
source: Sets the default values for the temporal change of sound (ADSR).
ar_sa: يضبط القيم الافتراضية للتغير الزمني للصوت (ADSR).
es_es: Establece los valores predeterminados para el cambio temporal del sonido (ADSR).
ko_kr: 소리의 시간적 변화(ADSR)의 기본값을 설정합니다.
zh_cn: 设置声音时间变化（ADSR）的默认值。
zh_tw: 設定聲音時間變化（ADSR）的預設值。

# AttackLabel
source: Attack
ar_sa: الهجوم
es_es: Ataque
ko_kr: 어택
zh_cn: 起音
zh_tw: 起音

# AttackTooltip
source: Time (in seconds) from the start of the sound until it reaches maximum volume.
ar_sa: الوقت (بالثواني) من بداية الصوت حتى يصل إلى أقصى مستوى صوت.
es_es: Tiempo (en segundos) desde el inicio del sonido hasta que alcanza el volumen máximo.
ko_kr: 소리가 시작된 후 최대 볼륨에 도달할 때까지의 시간(초).
zh_cn: 声音从开始到达到最大音量所需的时间（秒）。
zh_tw: 聲音從開始到達到最大音量所需的時間（秒）。

# DecayLabel
source: Decay
ar_sa: الاضمحلال
es_es: Decaimiento
ko_kr: 디케이
zh_cn: 衰减
zh_tw: 衰減

# DecayTooltip
source: Time (in seconds) to decay from maximum volume to the sustain level.
ar_sa: الوقت (بالثواني) للاضمحلال من أقصى مستوى صوت إلى مستوى الاستدامة.
es_es: Tiempo (en segundos) para decaer desde el volumen máximo hasta el nivel de sostenido.
ko_kr: 최대 볼륨에서 서스테인 레벨까지 감쇠하는 시간(초).
zh_cn: 从最大音量衰减到持续音量水平所需的时间（秒）。
zh_tw: 從最大音量衰減到持續音量水準所需的時間（秒）。

# SustainLabel
source: Sustain
ar_sa: الاستدامة
es_es: Sostenido
ko_kr: 서스테인
zh_cn: 持续音量
zh_tw: 持續音量

# SustainTooltip
source: The volume level while the note is held (0-1).
ar_sa: مستوى الصوت أثناء الضغط على النوتة (0-1).
es_es: El nivel de volumen mientras se mantiene la nota (0-1).
ko_kr: 노트가 눌려 있는 동안의 볼륨 레벨 (0-1).
zh_cn: 音符被按住期间的音量水平 (0-1)。
zh_tw: 音符被按住期間的音量水準 (0-1)。

# ReleaseLabel
source: Release
ar_sa: التحرير
es_es: Liberación
ko_kr: 릴리스
zh_cn: 释放
zh_tw: 釋放

# ReleaseTooltip
source: Time (in seconds) for the sound to fade out after the note is released.
ar_sa: الوقت (بالثواني) حتى يتلاشى الصوت بعد تحرير النوتة.
es_es: Tiempo (en segundos) para que el sonido se desvanezca después de soltar la nota.
ko_kr: 노트에서 손을 뗀 후 소리가 사라질 때까지의 시간(초).
zh_cn: 音符释放后声音消失所需的时间（秒）。
zh_tw: 音符釋放後聲音消失所需的時間（秒）。

# FmSourceGroupHeader
source: FM Source
ar_sa: مصدر FM
es_es: Fuente FM
ko_kr: FM 음원
zh_cn: FM 音源
zh_tw: FM 音源

# FmSourceTooltip
source: Settings related to FM synthesis method.
ar_sa: الإعدادات المتعلقة بطريقة توليف FM.
es_es: Configuraciones relacionadas con el método de síntesis FM.
ko_kr: FM 음원 방식 합성에 관한 설정입니다.
zh_cn: 与FM合成方法相关的设置。
zh_tw: 與FM合成方法相關的設定。

# ModulatorFrequencyLabel
source: Modulator Frequency (Hz)
ar_sa: تردد المُعدِّل (هرتز)
es_es: Frecuencia del Modulador (Hz)
ko_kr: 변조 주파수 (Hz)
zh_cn: 调制频率 (Hz)
zh_tw: 調變頻率 (Hz)

# ModulatorFrequencyTooltip
source: The frequency of the modulating wave in FM synthesis. Makes the timbre more complex.
ar_sa: تردد الموجة المُعدِّلة في توليف FM. يجعل الجرس أكثر تعقيدًا.
es_es: La frecuencia de la onda moduladora en la síntesis FM. Hace que el timbre sea más complejo.
ko_kr: FM 합성에서 변조 파형의 주파수입니다. 음색을 복잡하게 만듭니다.
zh_cn: FM 合成中调制波的频率。使音色更复杂。
zh_tw: FM 合成中調變波的頻率。使音色更複雜。

# ModulationIndexLabel
source: Modulation Index
ar_sa: معامل التعديل
es_es: Índice de Modulación
ko_kr: 변조 지수
zh_cn: 调制指数
zh_tw: 調變指數

# ModulationIndexTooltip
source: The depth of modulation in FM synthesis. Larger values result in more complex and metallic timbres.
ar_sa: عمق التعديل في توليف FM. تؤدي القيم الأكبر إلى أجراس أكثر تعقيدًا ومعدنية.
es_es: La profundidad de la modulación en la síntesis FM. Valores mayores dan como resultado timbres más complejos y metálicos.
ko_kr: FM 합성에서 변조의 깊이입니다. 값이 클수록 더 복잡하고 금속성 있는 음색이 됩니다.
zh_cn: FM 合成中调制的深度。值越大，音色越复杂和金属化。
zh_tw: FM 合成中調變的深度。值越大，音色越複雜和金屬化。

# QualityNoiseReductionGroupHeader
source: Quality/Noise Reduction
ar_sa: الجودة / تقليل الضوضاء
es_es: Calidad/Reducción de Ruido
ko_kr: 품질/노이즈 대책
zh_cn: 质量/降噪
zh_tw: 品質/降噪

# EnableBandlimitedSynthesisCheckbox
source: Enable Bandlimited Synthesis (Reduce Aliasing)
ar_sa: تمكين التوليف محدود النطاق (تقليل التعرج)
es_es: Habilitar Síntesis de Banda Limitada (Reducir Aliasing)
ko_kr: 밴드리미티드 합성 활성화 (에일리어싱 감소)
zh_cn: 启用带限合成 (减少混叠)
zh_tw: 啟用帶限合成 (減少混疊)

# EnableBandlimitedSynthesisTooltip
source: Enables techniques to reduce aliasing (folding noise) during waveform generation. Improves sound quality but slightly increases CPU load.
ar_sa: تمكين التقنيات لتقليل التعرج (ضوضاء الطي) أثناء توليد شكل الموجة. يحسن جودة الصوت ولكنه يزيد قليلاً من تحميل وحدة المعالج المركزية.
es_es: Habilita técnicas para reducir el aliasing (ruido de plegado) durante la generación de formas de onda. Mejora la calidad del sonido pero aumenta ligeramente la carga de la CPU.
ko_kr: 파형 생성 시 에일리어싱(폴딩 노이즈)을 줄이는 기술을 활성화합니다. 음질이 향상되지만 CPU 부하가 약간 증가합니다.
zh_cn: 启用在波形生成时减少混叠（折返噪声）的技术。提高音质，但会略微增加CPU负载。
zh_tw: 啟用在波形生成時減少混疊（折返噪音）的技術。提高音質，但會略微增加CPU負載。

# EnableAntiPopCheckbox
source: Enable Anti-Pop (Reduce Click Noise)
ar_sa: تمكين منع الفرقعة (تقليل ضوضاء النقر)
es_es: Habilitar Anti-Pop (Reducir Ruido de Clic)
ko_kr: 안티팝 활성화 (클릭 노이즈 감소)
zh_cn: 启用抗爆音 (减少咔嗒声)
zh_tw: 啟用抗爆音 (減少喀嗒聲)

# EnableAntiPopTooltip
source: Applies short fades at the start and end of notes to reduce 'pop' noises.
ar_sa: يطبق تلاشيات قصيرة في بداية ونهاية النوتات لتقليل ضوضاء 'الفرقعة'.
es_es: Aplica fundidos cortos al inicio y final de las notas para reducir ruidos de 'pop'.
ko_kr: 노트 시작과 끝에 짧은 페이드를 적용하여 '팝' 노이즈를 줄입니다.
zh_cn: 在音符的开始和结束时应用短时淡入淡出来减少“爆音”噪声。
zh_tw: 在音符的開始和結束時應用短時淡入淡出來減少「爆音」噪音。

# AntiPopAttackLabel
source: Attack (s)
ar_sa: الهجوم (ث)
es_es: Ataque (s)
ko_kr: 어택 (초)
zh_cn: 起音 (秒)
zh_tw: 起音 (秒)

# AntiPopReleaseLabel
source: Release (s)
ar_sa: التحرير (ث)
es_es: Liberación (s)
ko_kr: 릴리스 (초)
zh_cn: 释放 (秒)
zh_tw: 釋放 (秒)

# EnableNoteCrossfadeCheckbox
source: Enable Note Crossfade
ar_sa: تمكين التلاشي المتقاطع للنوتات
es_es: Habilitar Fundido Cruzado de Notas
ko_kr: 노트 크로스페이드 활성화
zh_cn: 启用音符交叉淡化
zh_tw: 啟用音符交叉淡化

# EnableNoteCrossfadeTooltip
source: Smoothes transitions between notes to reduce noise.
ar_sa: ينعم الانتقالات بين النوتات لتقليل الضوضاء.
es_es: Suaviza las transiciones entre notas para reducir el ruido.
ko_kr: 노트 전환을 부드럽게 하여 노이즈를 줄입니다.
zh_cn: 平滑音符之间的过渡以减少噪音。
zh_tw: 平滑音符之間的過渡以減少噪音。

# CrossfadeTimeLabel
source: Crossfade Time(s)
ar_sa: وقت التلاشي المتقاطع(ث)
es_es: Tiempo de Fundido(s)
ko_kr: 크로스페이드 시간(초)
zh_cn: 交叉淡化时间(秒)
zh_tw: 交叉淡化時間(秒)

# EffectsTabHeader
source: Effects
ar_sa: المؤثرات
es_es: Efectos
ko_kr: 이펙트
zh_cn: 效果
zh_tw: 效果

# EffectsTabTooltip
source: Configure various effects to adjust audio quality.
ar_sa: قم بتكوين مؤثرات مختلفة لضبط جودة الصوت.
es_es: Configura varios efectos para ajustar la calidad del audio.
ko_kr: 음질을 조정하기 위한 다양한 이펙트를 설정합니다.
zh_cn: 配置各种效果来调整音质。
zh_tw: 配置各種效果來調整音質。

# EnableEffectsCheckbox
source: Enable Effects
ar_sa: تمكين المؤثرات
es_es: Habilitar Efectos
ko_kr: 이펙트 활성화
zh_cn: 启用效果
zh_tw: 啟用效果

# EnableEffectsTooltip
source: Toggles all audio effects on/off.
ar_sa: تبديل جميع المؤثرات الصوتية بين تشغيل / إيقاف.
es_es: Activa/desactiva todos los efectos de audio.
ko_kr: 모든 오디오 이펙트 활성화/비활성화 전환합니다.
zh_cn: 切换所有音频效果的开关。
zh_tw: 切換所有音訊效果的開關。

# CompressorGroupHeader
source: Compressor
ar_sa: ضاغط
es_es: Compresor
ko_kr: 컴프레서
zh_cn: 压缩器
zh_tw: 壓縮器

# CompressorTooltip
source: An effect that suppresses volume variations and increases sound pressure.
ar_sa: تأثير يقلل من تقلبات مستوى الصوت ويزيد من ضغط الصوت.
es_es: Un efecto que suprime las variaciones de volumen y aumenta la presión sonora.
ko_kr: 볼륨 변동을 억제하고 음압을 높이는 이펙트입니다.
zh_cn: 抑制音量变化并增加声压的效果。
zh_tw: 抑制音量變化並增加聲壓的效果。

# EnableCompressorCheckbox
source: Enable Compressor
ar_sa: تمكين الضاغط
es_es: Habilitar Compresor
ko_kr: 컴프레서 활성화
zh_cn: 启用压缩器
zh_tw: 啟用壓縮器

# CompressorThresholdLabel
source: Threshold
ar_sa: العتبة
es_es: Umbral
ko_kr: 임계값
zh_cn: 阈值
zh_tw: 閾值

# CompressorThresholdTooltip
source: The volume threshold at which the compressor starts working.
ar_sa: عتبة مستوى الصوت التي يبدأ عندها الضاغط في العمل.
es_es: El umbral de volumen al que el compresor comienza a funcionar.
ko_kr: 컴프레서가 작동하기 시작하는 볼륨 임계값입니다.
zh_cn: 压缩器开始工作的音量阈值。
zh_tw: 壓縮器開始工作的音量閾值。

# CompressorRatioLabel
source: Ratio
ar_sa: النسبة
ko_kr: 비율
zh_cn: 比率
zh_tw: 比率

# CompressorRatioTooltip
source: The ratio at which sound exceeding the threshold is compressed. E.g.
ar_sa: 임계값을 초과하는 사운드를 압축하는 비율입니다. 예: 4:1 비율은 임계값을 4dB 초과한 사운드를 1dB 초과한 사운드로 압축합니다.
es_es: 超過閾值的聲音被壓縮的比例。例如4:1，超過閾值4dB的聲音將被壓縮到超過閾值1dB。
id_id: La proporción en que se comprime el sonido que supera el umbral. P.ej.
ko_kr: 超过阈值的声音被压缩的比例。例如4:1，超过阈值4dB的声音将被压缩到超过阈值1dB。
zh_cn: at 4:1
zh_tw: sound 4dB over the threshold is compressed to 1dB over.

# CompressorAttackLabel
source: Attack (s)
ar_sa: الهجوم (ث)
es_es: Ataque (s)
ko_kr: 어택 (초)
zh_cn: 起音 (秒)
zh_tw: 起音 (秒)

# CompressorAttackTooltip
source: The time (in seconds) it takes for the compressor to start working.
ar_sa: الوقت (بالثواني) الذي يستغرقه الضاغط لبدء العمل.
es_es: El tiempo (en segundos) que tarda el compresor en empezar a funcionar.
ko_kr: 컴프레서가 작동하기 시작할 때까지의 시간(초)입니다.
zh_cn: 压缩器开始工作所需的时间（秒）。
zh_tw: 壓縮器開始工作所需的時間（秒）。

# CompressorReleaseLabel
source: Release (s)
ar_sa: التحرير (ث)
es_es: Liberación (s)
ko_kr: 릴리스 (초)
zh_cn: 释放 (秒)
zh_tw: 釋放 (秒)

# CompressorReleaseTooltip
source: The time (in seconds) it takes for the compressor to release.
ar_sa: الوقت (بالثواني) الذي يستغرقه الضاغط للتوقف عن العمل.
es_es: El tiempo (en segundos) que tarda el compresor en liberarse.
ko_kr: 컴프레서가 해제될 때까지의 시간(초)입니다.
zh_cn: 压缩器释放所需的时间（秒）。
zh_tw: 壓縮器釋放所需的時間（秒）。

# AlgorithmicReverbGroupHeader
source: Algorithmic Reverb
ar_sa: صدى خوارزمي
es_es: Reverberación Algorítmica
ko_kr: 알고리즘 리버브
zh_cn: 算法混响
zh_tw: 演算法混響

# AlgorithmicReverbTooltip
source: A high-quality reverb that generates reverberation through calculations.
ar_sa: صدى عالي الجودة يولد صدى صوتي من خلال العمليات الحسابية.
es_es: Una reverberación de alta calidad que genera reverberación mediante cálculos.
ko_kr: 계산을 통해 잔향을 생성하는 고품질 리버브입니다.
zh_cn: 通过计算产生混响的高质量混响。
zh_tw: 通過計算產生殘響的高品質混響。

# EnableAlgorithmicReverbCheckbox
source: Enable Algorithmic Reverb
ar_sa: تمكين صدى خوارزمي
es_es: Habilitar Reverberación Algorítmica
ko_kr: 알고리즘 리버브 활성화
zh_cn: 启用算法混响
zh_tw: 啟用演算法混響

# ReverbRoomSizeLabel
source: Room Size
ar_sa: حجم الغرفة
es_es: Tamaño de Sala
ko_kr: 방 크기
zh_cn: 房间大小
zh_tw: 房間大小

# ReverbDampingLabel
source: Damping
ar_sa: التخميد
es_es: Amortiguación
ko_kr: 댐핑
zh_cn: 阻尼
zh_tw: 阻尼

# ReverbWetLevelLabel
source: Wet
ar_sa: رطب
ko_kr: 웻
zh_cn: 湿声
zh_tw: 濕聲

# ReverbDryLevelLabel
source: Dry
ar_sa: جاف
ko_kr: 드라이
zh_cn: 干声
zh_tw: 乾聲

# ReverbWidthLabel
source: Width
ar_sa: الاتساع
es_es: Anchura
ko_kr: 너비
zh_cn: 宽度
zh_tw: 寬度
