Repository: routersys/YMM4-MIDI
Catalog: MIDI/Localization/Translate.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# ConvolutionReverbGroupHeader
source: Convolution Reverb
ar_sa: صدى التوافقي
es_es: Reverberación de Convolución
ko_kr: 컨볼루션 리버브
zh_cn: 卷积混响
zh_tw: 摺積混響

# ConvolutionReverbTooltip
source: Uses an Impulse Response (IR) file to reproduce realistic reverberation.
ar_sa: يستخدم ملف استجابة نبضية (IR) لإعادة إنتاج صدى صوتي واقعي.
es_es: Utiliza un archivo de Respuesta a Impulso (IR) para reproducir una reverberación realista.
ko_kr: 임펄스 응답(IR) 파일을 사용하여 사실적인 잔향을 재현합니다.
zh_cn: 使用脉冲响应(IR)文件再现实时混响。
zh_tw: 使用脈衝響應(IR)檔案重現真實殘響。

# EnableConvolutionReverbCheckbox
source: Enable Convolution Reverb
ar_sa: تمكين صدى التوافقي
es_es: Habilitar Reverberación de Convolución
ko_kr: 컨볼루션 리버브 활성화
zh_cn: 启用卷积混响
zh_tw: 啟用摺積混響

# IrFilePathLabel
source: IR File Path
ar_sa: مسار ملف IR
es_es: Ruta Archivo IR
ko_kr: IR 파일 경로
zh_cn: IR 文件路径
zh_tw: IR 檔案路徑

# BrowseButton
source: Browse...
ar_sa: استعراض...
es_es: Explorar...
zh_cn: 浏览...
zh_tw: 瀏覽...

# MaxIrDurationLabel
source: Max Load Time (s)
ar_sa: أقصى وقت تحميل (ث)
es_es: Tiempo Máx. Carga (s)
ko_kr: 최대 로드 시간 (초)
zh_cn: 最大加载时间 (秒)
zh_tw: 最大載入時間 (秒)

# MaxIrDurationTooltip
source: Specify the maximum load time for the impulse response file in seconds.
ar_sa: حدد أقصى وقت تحميل لملف الاستجابة النبضية بالثواني.
es_es: Especifique el tiempo máximo de carga para el archivo de respuesta a impulso en segundos.
ko_kr: 임펄스 응답 파일의 최대 로드 시간을 초 단위로 지정합니다.
zh_cn: 指定脉冲响应文件的最大加载时间（秒）。
zh_tw: 指定脈衝響應檔案的最大載入時間（秒）。

# DistortionGroupHeader
source: Distortion
ar_sa: تشويه
es_es: Distorsión
ko_kr: 디스토션
zh_cn: 失真
zh_tw: 失真

# DistortionTooltip
source: Distorts the sound to create a powerful sound.
ar_sa: يشوه الصوت لخلق صوت قوي.
es_es: Distorsiona el sonido para crear un sonido potente.
ko_kr: 사운드를 왜곡하여 강력한 사운드를 만듭니다.
zh_cn: 扭曲声音以创造强大的声音。
zh_tw: 扭曲聲音以創造強大的聲音。

# EnableDistortionCheckbox
source: Enable Distortion
ar_sa: تمكين التشويه
es_es: Habilitar Distorsión
ko_kr: 디스토션 활성화
zh_cn: 启用失真
zh_tw: 啟用失真

# DistortionTypeLabel
source: Type
ar_sa: النوع
es_es: Tipo
ko_kr: 종류
zh_cn: 类型
zh_tw: 類型

# DistortionDriveLabel
source: Drive
ar_sa: القيادة
ko_kr: 드라이브
zh_cn: 驱动
zh_tw: 驅動

# DistortionMixLabel
source: Mix
ar_sa: مزيج
es_es: Mezcla
ko_kr: 믹스
zh_cn: 混合
zh_tw: 混合

# BitCrusherGroupHeader
source: Bit Crusher
ar_sa: سحق البت
ko_kr: 비트 크러셔
zh_cn: 比特失真
zh_tw: 位元壓縮

# BitCrusherTooltip
source: Intentionally degrades sound quality to create a retro sound.
ar_sa: يقلل جودة الصوت عمداً لخلق صوت قديم.
es_es: Degrada intencionalmente la calidad del sonido para crear un sonido retro.
ko_kr: 의도적으로 음질을 저하시켜 레트로 사운드를 만듭니다.
zh_cn: 故意降低音质以创造复古声音。
zh_tw: 故意降低音質以創造復古聲音。

# EnableBitCrusherCheckbox
source: Enable Bit Crusher
ar_sa: تمكين سحق البت
es_es: Habilitar Bit Crusher
ko_kr: 비트 크러셔 활성화
zh_cn: 启用比特失真
zh_tw: 啟用位元壓縮

# BitDepthLabel
source: Bit Depth
ar_sa: عمق البت
es_es: Profundidad de Bits
ko_kr: 비트 심도
zh_cn: 位深度
zh_tw: 位元深度

# RateReductionLabel
source: Rate Reduction
ar_sa: تقليل المعدل
es_es: Reducción de Tasa
ko_kr: 레이트 감소
zh_cn: 速率降低
zh_tw: 速率降低

# PingPongDelayGroupHeader
source: Ping Pong Delay
ar_sa: تأخير بينغ بونغ
es_es: Delay Ping Pong
ko_kr: 핑퐁 딜레이
zh_cn: 乒乓延迟
zh_tw: 乒乓延遲

# PingPongDelayTooltip
source: A delay that creates an echo effect alternating between left and right channels.
ar_sa: تأخير يخلق تأثير صدى يتناوب بين القنوات اليسرى واليمنى.
es_es: Un retardo que crea un efecto de eco alternando entre los canales izquierdo y derecho.
ko_kr: 좌우 채널에서 번갈아 메아리 효과를 내는 딜레이입니다.
zh_cn: 在左右声道之间交替产生回声效果的延迟。
zh_tw: 在左右聲道之間交替產生回聲效果的延遲。

# EnablePingPongDelayCheckbox
source: Enable Ping Pong Delay
ar_sa: تمكين تأخير بينغ بونغ
es_es: Habilitar Delay Ping Pong
ko_kr: 핑퐁 딜레이 활성화
zh_cn: 启用乒乓延迟
zh_tw: 啟用乒乓延遲

# DelayTimeLabel
source: Delay Time (s)
ar_sa: وقت التأخير (ث)
es_es: Tiempo de Delay (s)
ko_kr: 딜레이 타임 (초)
zh_cn: 延迟时间 (秒)
zh_tw: 延遲時間 (秒)

# DelayTimeTooltip
source: The interval of the echo (in seconds).
ar_sa: الفاصل الزمني للصدى (بالثواني).
es_es: El intervalo del eco (en segundos).
ko_kr: 메아리 간격(초).
zh_cn: 回声的间隔（秒）。
zh_tw: 回聲的間隔（秒）。

# FeedbackLabel
source: Feedback
ar_sa: ردود الفعل
es_es: Retroalimentación
ko_kr: 피드백
zh_cn: 反馈
zh_tw: 反饋

# FeedbackTooltip
source: The number of times the echo repeats.
ar_sa: عدد مرات تكرار الصدى.
es_es: El número de veces que se repite el eco.
ko_kr: 메아리가 반복되는 횟수.
zh_cn: 回声重复的次数。
zh_tw: 回聲重複的次數。

# MixLabel
source: Mix
ar_sa: مزيج
es_es: Mezcla
ko_kr: 믹스
zh_cn: 混合
zh_tw: 混合

# MixTooltip
source: The balance between the original sound (dry) and the effect sound (wet).
ar_sa: التوازن بين الصوت الأصلي (الجاف) وصوت التأثير (الرطب).
es_es: El equilibrio entre el sonido original (seco) y el sonido del efecto (húmedo).
ko_kr: 원본 사운드(드라이)와 이펙트 사운드(웻)의 밸런스.
zh_cn: 原始声音（干声）和效果声音（湿声）之间的平衡。
zh_tw: 原始聲音（乾聲）和效果聲音（濕聲）之間的平衡。

# ChorusGroupHeader
source: Chorus
ar_sa: جوقة
ko_kr: 코러스
zh_cn: 合唱
zh_tw: 合唱

# ChorusTooltip
source: Adds thickness and width to the sound by slightly detuning and layering it.
ar_sa: يضيف سماكة واتساعًا للصوت عن طريق تعديل درجة الصوت قليلاً وتطبيقه.
es_es: Añade grosor y amplitud al sonido desafinándolo ligeramente y superponiéndolo.
ko_kr: 사운드를 약간 흔들어 겹쳐서 사운드에 두께와 넓이를 줍니다.
zh_cn: 通过轻微的晃动和叠加声音，为声音增添厚度和宽度。
zh_tw: 通過輕微的晃動和疊加聲音，為聲音增添厚度和寬度。

# EnableChorusCheckbox
source: Enable Chorus
ar_sa: تمكين الجوقة
es_es: Habilitar Chorus
ko_kr: 코러스 활성화
zh_cn: 启用合唱
zh_tw: 啟用合唱

# ChorusDelayLabel
source: Delay (s)
ar_sa: التأخير (ث)
ko_kr: 딜레이 (초)
zh_cn: 延迟 (秒)
zh_tw: 延遲 (秒)

# ChorusDelayTooltip
source: The delay time (in seconds) of the layered sound against the original sound.
ar_sa: وقت التأخير (بالثواني) للصوت المضاف فوق الصوت الأصلي.
es_es: El tiempo de retardo (en segundos) del sonido superpuesto contra el sonido original.
ko_kr: 원본 사운드에 겹치는 사운드의 딜레이 시간(초).
zh_cn: 叠加声音相对于原始声音的延迟时间（秒）。
zh_tw: 疊加聲音相對於原始聲音的延遲時間（秒）。

# ChorusDepthLabel
source: Depth
ar_sa: العمق
es_es: Profundidad
ko_kr: 깊이
zh_cn: 深度
zh_tw: 深度

# ChorusDepthTooltip
source: The depth of the sound modulation.
ar_sa: عمق تعديل الصوت.
es_es: La profundidad de la modulación del sonido.
ko_kr: 사운드 변조의 깊이.
zh_cn: 声音调制的深度。
zh_tw: 聲音調製的深度。

# ChorusRateLabel
source: Rate (Hz)
ar_sa: المعدل (هرتز)
es_es: Tasa (Hz)
ko_kr: 레이트 (Hz)
zh_cn: 速率 (Hz)
zh_tw: 速率 (Hz)

# ChorusRateTooltip
source: The speed of the sound modulation (in Hz).
ar_sa: سرعة تعديل الصوت (بالهرتز).
es_es: La velocidad de la modulación del sonido (en Hz).
ko_kr: 사운드 변조 속도(Hz).
zh_cn: 声音调制的速度（Hz）。
zh_tw: 聲音調製的速度（Hz）。

# ChorusStrengthLabel
source: Strength
ar_sa: القوة
es_es: Fuerza
ko_kr: 강도
zh_cn: 强度
zh_tw: 強度

# ChorusStrengthTooltip
source: The strength of the chorus sound relative to the original sound.
ar_sa: قوة صوت الجوقة بالنسبة للصوت الأصلي.
es_es: La fuerza del sonido del chorus en relación con el sonido original.
ko_kr: 원본 사운드에 대한 코러스 사운드의 강도.
zh_cn: 合唱声音相对于原始声音的强度。
zh_tw: 合唱聲音相對於原始聲音的強度。

# PhaserGroupHeader
source: Phaser
ar_sa: المحول الطوري
ko_kr: 페이저
zh_cn: 移相器
zh_tw: 移相器

# PhaserTooltip
source: An effect that creates a unique swirling sound by shifting the phase of the sound.
ar_sa: تأثير يخلق صوتًا دوارًا فريدًا عن طريق تحويل طور الصوت.
es_es: Un efecto que crea un sonido giratorio único al desplazar la fase del sonido.
ko_kr: 사운드의 위상을 이동시켜 독특한 소용돌이 사운드를 만드는 이펙트입니다.
zh_cn: 通过改变声音的相位来创造独特旋转声音的效果。
zh_tw: 通過改變聲音的相位來創造獨特旋轉聲音的效果。

# EnablePhaserCheckbox
source: Enable Phaser
ar_sa: تمكين المحول الطوري
es_es: Habilitar Phaser
ko_kr: 페이저 활성화
zh_cn: 启用移相器
zh_tw: 啟用移相器

# PhaserRateLabel
source: Rate (Hz)
ar_sa: المعدل (هرتز)
es_es: Tasa (Hz)
ko_kr: 레이트 (Hz)
zh_cn: 速率 (Hz)
zh_tw: 速率 (Hz)

# PhaserRateTooltip
source: The speed at which the phase is changed (in Hz).
ar_sa: السرعة التي يتم بها تغيير الطور (بالهرتز).
es_es: La velocidad a la que se cambia la fase (en Hz).
ko_kr: 위상을 변화시키는 속도(Hz).
zh_cn: 改变相位的速度（Hz）。
zh_tw: 改變相位的速度（Hz）。

# PhaserStagesLabel
source: Stages
ar_sa: المراحل
es_es: Etapas
ko_kr: 스테이지 수
zh_cn: 级数
zh_tw: 級數

# PhaserStagesTooltip
source: The number of filter stages in the phaser. More stages create a more complex effect.
ar_sa: عدد مراحل المرشح في المحول الطوري. المزيد من المراحل يخلق تأثيرًا أكثر تعقيدًا.
es_es: El número de etapas de filtro en el phaser. Más etapas crean un efecto más complejo.
ko_kr: 페이저의 필터 단 수. 많을수록 복잡한 효과가 나타납니다.
zh_cn: 移相器中滤波器的级数。级数越多，效果越复杂。
zh_tw: 移相器中濾波器的級數。級數越多，效果越複雜。

# PhaserFeedbackLabel
source: Feedback
ar_sa: ردود الفعل
es_es: Retroalimentación
ko_kr: 피드백
zh_cn: 反馈
zh_tw: 反饋

# PhaserFeedbackTooltip
source: The amount of the effect sound fed back into the input. Emphasizes the effect.
ar_sa: كمية صوت التأثير المُعاد إدخاله. يؤكد على التأثير.
es_es: La cantidad de sonido del efecto retroalimentado a la entrada. Enfatiza el efecto.
ko_kr: 이펙트 사운드를 다시 입력으로 피드백하는 양. 이펙트를 강조합니다.
zh_cn: 反馈到输入的效应声音量。强调效果。
zh_tw: 反饋到輸入的效應聲音量。強調效果。

# FlangerGroupHeader
source: Flanger
ar_sa: الشفير
ko_kr: 플랜저
zh_cn: 镶边器
zh_tw: 鑲邊器

# FlangerTooltip
source: Similar to chorus
ar_sa: 코러스와 비슷하지만 더 짧고 주기적인 딜레이를 사용하여 금속성의 소용돌이 사운드를 만듭니다.
es_es: 類似於合唱，但使用更短、週期性的延遲來創造金屬般的旋轉聲音。
id_id: Similar al chorus
ko_kr: 类似于合唱，但使用更短、周期性的延迟来创造金属般的旋转声音。
zh_cn: but uses shorter
zh_tw: periodic delays to create a metallic swirling sound.

# EnableFlangerCheckbox
source: Enable Flanger
ar_sa: تمكين الشفير
es_es: Habilitar Flanger
ko_kr: 플랜저 활성화
zh_cn: 启用镶边器
zh_tw: 啟用鑲邊器

# FlangerDelayLabel
source: Delay (s)
ar_sa: التأخير (ث)
ko_kr: 딜레이 (초)
zh_cn: 延迟 (秒)
zh_tw: 延遲 (秒)

# FlangerDelayTooltip
source: Delay time (in seconds).
ar_sa: وقت التأخير (بالثواني).
es_es: Tiempo de retardo (en segundos).
ko_kr: 딜레이 시간(초).
zh_cn: 延迟时间（秒）。
zh_tw: 延遲時間（秒）。

# FlangerRateLabel
source: Rate (Hz)
ar_sa: المعدل (هرتز)
es_es: Tasa (Hz)
ko_kr: 레이트 (Hz)
zh_cn: 速率 (Hz)
zh_tw: 速率 (Hz)

# FlangerRateTooltip
source: The speed of the swirl (in Hz).
ar_sa: سرعة الدوامة (بالهرتز).
es_es: La velocidad del remolino (en Hz).
ko_kr: 소용돌이 속도(Hz).
zh_cn: 旋转的速度（Hz）。
zh_tw: 旋轉的速度（Hz）。

# FlangerDepthLabel
source: Depth
ar_sa: العمق
es_es: Profundidad
ko_kr: 깊이
zh_cn: 深度
zh_tw: 深度

# FlangerDepthTooltip
source: The depth of the swirl.
ar_sa: عمق الدوامة.
es_es: La profundidad del remolino.
ko_kr: 소용돌이의 깊이.
zh_cn: 旋转的深度。
zh_tw: 旋轉的深度。

# LimiterGroupHeader
source: Limiter
ar_sa: المحدد
es_es: Limitador
ko_kr: 리미터
zh_cn: 限制器
zh_tw: 限制器

# LimiterTooltip
source: Limits the volume from exceeding a certain threshold
ar_sa: Limita el volumen para que no supere un cierto umbral
es_es: 볼륨이 특정 임계값을 초과하지 않도록 제한하여 클리핑을 방지합니다.
id_id: evitando el recorte.
ko_kr: 限制音量不超過某個閾值，防止削波。
zh_cn: preventing clipping.
zh_tw: 限制音量不超过某个阈值，防止削波。

# EnableLimiterCheckbox
source: Enable Limiter
ar_sa: تمكين المحدد
es_es: Habilitar Limitador
ko_kr: 리미터 활성화
zh_cn: 启用限制器
zh_tw: 啟用限制器

# LimiterThresholdLabel
source: Threshold
ar_sa: العتبة
es_es: Umbral
ko_kr: 임계값
zh_cn: 阈值
zh_tw: 閾值

# LimiterThresholdTooltip
source: The upper limit to restrict the volume.
ar_sa: الحد الأعلى لتقييد مستوى الصوت.
es_es: El límite superior para restringir el volumen.
ko_kr: 볼륨을 제한하는 상한값.
zh_cn: 限制音量的上限。
zh_tw: 限制音量的上限。

# EqualizerGroupHeader
source: Equalizer
ar_sa: المعادل
es_es: Ecualizador
ko_kr: 이퀄라이저
zh_cn: 均衡器
zh_tw: 等化器

# EqualizerTooltip
source: Adjusts sound quality by boosting or cutting specific frequency bands.
ar_sa: يضبط جودة الصوت عن طريق تعزيز أو خفض نطاقات تردد معينة.
es_es: Ajusta la calidad del sonido realzando o atenuando bandas de frecuencia específicas.
ko_kr: 특정 주파수 대역을 강조하거나 억제하여 음질을 조정합니다.
zh_cn: 通过增强或抑制特定频段来调整音质。
zh_tw: 通過增強或抑制特定頻段來調整音質。

# EnableEqualizerCheckbox
source: Enable Equalizer
ar_sa: تمكين المعادل
es_es: Habilitar Ecualizador
ko_kr: 이퀄라이저 활성화
zh_cn: 启用均衡器
zh_tw: 啟用等化器

# EqBassGainLabel
source: Bass Gain
ar_sa: كسب الجهير
es_es: Ganancia de Graves
ko_kr: 저음 게인
zh_cn: 低音增益
zh_tw: 低音增益

# EqBassGainTooltip
source: Adjusts the gain (volume) of the bass range.
ar_sa: يضبط الكسب (مستوى الصوت) لنطاق الجهير.
es_es: Ajusta la ganancia (volumen) del rango de graves.
ko_kr: 저음역의 게인(볼륨)을 조정합니다.
zh_cn: 调整低音范围的增益（音量）。
zh_tw: 調整低音範圍的增益（音量）。

# EqMidGainLabel
source: Mid Gain
ar_sa: كسب المتوسط
es_es: Ganancia de Medios
ko_kr: 중음 게인
zh_cn: 中音增益
zh_tw: 中音增益

# EqMidGainTooltip
source: Adjusts the gain (volume) of the mid range.
ar_sa: يضبط الكسب (مستوى الصوت) للنطاق المتوسط.
es_es: Ajusta la ganancia (volumen) del rango medio.
ko_kr: 중음역의 게인(볼륨)을 조정합니다.
zh_cn: 调整中音范围的增益（音量）。
zh_tw: 調整中音範圍的增益（音量）。

# EqTrebleGainLabel
source: Treble Gain
ar_sa: كسب الثلاثي
es_es: Ganancia de Agudos
ko_kr: 고음 게인
zh_cn: 高音增益
zh_tw: 高音增益

# EqTrebleGainTooltip
source: Adjusts the gain (volume) of the treble range.
ar_sa: يضبط الكسب (مستوى الصوت) لنطاق الثلاثي.
es_es: Ajusta la ganancia (volumen) del rango de agudos.
ko_kr: 고음역의 게인(볼륨)을 조정합니다.
zh_cn: 调整高音范围的增益（音量）。
zh_tw: 調整高音範圍的增益（音量）。

# OtherEffectsGroupHeader
source: Other
ar_sa: أخرى
es_es: Otros
ko_kr: 기타
zh_cn: 其他
zh_tw: 其他

# EnableDcOffsetRemovalCheckbox
source: Enable DC Offset Removal
ar_sa: تمكين إزالة إزاحة التيار المستمر
es_es: Habilitar Eliminación de Desplazamiento DC
ko_kr: DC 오프셋 제거 활성화
zh_cn: 启用直流偏移消除
zh_tw: 啟用直流偏移消除

# EnableDcOffsetRemovalTooltip
source: Removes the direct current component (DC offset) from the audio signal. Prevents unwanted noise and distortion.
ar_sa: يزيل مكون التيار المستمر (إزاحة التيار المستمر) من إشارة الصوت. يمنع الضوضاء والتشويه غير المرغوب فيه.
es_es: Elimina el componente de corriente continua (desplazamiento DC) de la señal de audio. Previene ruidos y distorsiones no deseadas.
ko_kr: 오디오 신호에 포함된 직류 성분(DC 오프셋)을 제거합니다. 불필요한 노이즈나 왜곡을 방지합니다.
zh_cn: 消除音频信号中的直流分量（DC偏移）。防止不必要的噪音和失真。
zh_tw: 消除音訊信號中的直流分量（DC偏移）。防止不必要的噪音和失真。

# InstrumentTabHeader
source: Instruments
ar_sa: الآلات
es_es: Instrumentos
ko_kr: 악기
zh_cn: 乐器
zh_tw: 樂器

# InstrumentTabTooltip
source: Configure timbre settings according to MIDI program numbers.
ar_sa: تكوين إعدادات الجرس وفقًا لأرقام برنامج MIDI.
es_es: Configura los ajustes de timbre según los números de programa MIDI.
ko_kr: MIDI 프로그램 번호에 따른 음색 설정을 합니다.
zh_cn: 根据MIDI程序编号配置音色设置。
zh_tw: 根據MIDI程式編號設定音色。

# InstrumentPresetTabHeader
source: Preset
ar_sa: إعداد مسبق
es_es: Preajuste
ko_kr: 프리셋
zh_cn: 预设
zh_tw: 預設

# InstrumentPresetTabTooltip
source: Assign timbre settings to a range of MIDI program numbers.
ar_sa: تعيين إعدادات الجرس لنطاق من أرقام برنامج MIDI.
es_es: Asigna configuraciones de timbre a un rango de números de programa MIDI.
ko_kr: MIDI 프로그램 번호 범위에 음색 설정을 할당합니다.
zh_cn: 为MIDI程序编号范围分配音色设置。
zh_tw: 為MIDI程式編號範圍分配音色設定。

# AddButton
source: Add
ar_sa: إضافة
es_es: Añadir
ko_kr: 추가
zh_cn: 添加
zh_tw: 新增

# DeleteButton
source: Delete
ar_sa: حذف
es_es: Eliminar
ko_kr: 삭제
zh_cn: 删除
zh_tw: 刪除

# AddInstrumentPresetTooltip
source: Adds a new instrument preset.
ar_sa: يضيف إعداد مسبق جديد للآلة.
es_es: Añade un nuevo preajuste de instrumento.
ko_kr: 새 악기 프리셋을 추가합니다.
zh_cn: 添加新的乐器预设。
zh_tw: 新增樂器預設。

# RemoveInstrumentPresetTooltip
source: Deletes the selected preset.
ar_sa: يحذف الإعداد المسبق المحدد.
es_es: Elimina el preajuste seleccionado.
ko_kr: 선택한 프리셋을 삭제합니다.
zh_cn: 删除所选预设。
zh_tw: 刪除所選預設。

# HeaderName
source: Name
ar_sa: الاسم
es_es: Nombre
ko_kr: 이름
zh_cn: 名称
zh_tw: 名稱

# HeaderStart
source: Start
ar_sa: البداية
es_es: Inicio
ko_kr: 시작
zh_cn: 开始
zh_tw: 開始

# HeaderEnd
source: End
ar_sa: النهاية
es_es: Fin
ko_kr: 종료
zh_cn: 结束
zh_tw: 結束

# HeaderWaveform
source: Waveform
ar_sa: الشكل الموجي
es_es: Forma de onda
ko_kr: 파형
zh_cn: 波形
zh_tw: 波形

# HeaderAttack
source: Attack
ar_sa: الهجوم
es_es: Ataque
ko_kr: 어택
zh_cn: 起音
zh_tw: 起音

# HeaderDecay
source: Decay
ar_sa: الاضمحلال
es_es: Decaimiento
ko_kr: 디케이
zh_cn: 衰减
zh_tw: 衰減

# HeaderSustain
source: Sustain
ar_sa: الاستدامة
es_es: Sostenido
ko_kr: 서스테인
zh_cn: 持续
zh_tw: 持續

# HeaderRelease
source: Release
ar_sa: التحرير
es_es: Liberación
ko_kr: 릴리스
zh_cn: 释放
zh_tw: 釋放

# HeaderVolume
source: Volume
ar_sa: مستوى الصوت
es_es: Volumen
ko_kr: 볼륨
zh_cn: 音量
zh_tw: 音量

# HeaderFilter
source: Filter
ar_sa: المرشح
es_es: Filtro
ko_kr: 필터
zh_cn: 滤波器
zh_tw: 濾波器

# HeaderCutoff
source: Cutoff
ar_sa: القطع
es_es: Corte
ko_kr: 컷오프
zh_cn: 截止
zh_tw: 截止

# HeaderResonance
source: Resonance
ar_sa: الرنين
es_es: Resonancia
ko_kr: 레조넌스
zh_cn: 共振
zh_tw: 共振

# HeaderFilterLfo
source: Filter LFO
ar_sa: مرشح LFO
es_es: Filtro LFO
ko_kr: 필터 LFO
zh_cn: 滤波器LFO
zh_tw: 濾波器LFO

# HeaderFLfoRate
source: F-LFO Rate
ar_sa: معدل F-LFO
es_es: Tasa F-LFO
zh_cn: F-LFO 速率
zh_tw: F-LFO 速率

# HeaderFLfoDepth
source: F-LFO Depth
ar_sa: عمق F-LFO
es_es: Prof. F-LFO
zh_cn: F-LFO 深度
zh_tw: F-LFO 深度

# InstrumentCustomTabHeader
source: Custom
ar_sa: مخصص
es_es: Personalizado
ko_kr: 커스텀
zh_cn: 自定义
zh_tw: 自訂

# InstrumentCustomTabTooltip
source: Assign individual timbre settings to specific MIDI program numbers. Set to -1 for percussion channel (10).
ar_sa: تعيين إعدادات جرس فردية لأرقام برنامج MIDI محددة. اضبط على -1 لقناة الإيقاع (10).
es_es: Asigna configuraciones de timbre individuales a números de programa MIDI específicos. Establece -1 para el canal de percusión (10).
ko_kr: 특정 MIDI 프로그램 번호에 개별 음색 설정을 할당합니다. 퍼커션 채널(10)의 경우 -1로 설정합니다.
zh_cn: 为特定的MIDI程序编号分配单独的音色设置。打击乐通道（10）请设置为-1。
zh_tw: 為特定的MIDI程式編號分配單獨的音色設定。打擊樂通道（10）請設定為-1。

# AddCustomInstrumentTooltip
source: Adds a new custom instrument.
ar_sa: يضيف آلة مخصصة جديدة.
es_es: Añade un nuevo instrumento personalizado.
ko_kr: 새 커스텀 악기를 추가합니다.
zh_cn: 添加新的自定义乐器。
zh_tw: 新增自訂樂器。

# RemoveCustomInstrumentTooltip
source: Deletes the selected custom instrument.
ar_sa: يحذف الآلة المخصصة المحددة.
es_es: Elimina el instrumento personalizado seleccionado.
ko_kr: 선택한 커스텀 악기를 삭제합니다.
zh_cn: 删除所选的自定义乐器。
zh_tw: 刪除所選的自訂樂器。

# HeaderProgram
source: Program
ar_sa: البرنامج
es_es: Programa
ko_kr: 프로그램
zh_cn: 程序
zh_tw: 程式

# HeaderWavetableFile
source: Wavetable File
ar_sa: ملف Wavetable
es_es: Archivo Wavetable
ko_kr: Wavetable 파일
zh_cn: Wavetable 文件
zh_tw: Wavetable 檔案

# HeaderFLfoWaveform
source: F-LFO Wave
ar_sa: موجة F-LFO
es_es: Onda F-LFO
ko_kr: F-LFO 파형
zh_cn: F-LFO 波形
zh_tw: F-LFO 波形

# HeaderPLfoWaveform
source: P-LFO Wave
ar_sa: موجة P-LFO
es_es: Onda P-LFO
ko_kr: P-LFO 파형
zh_cn: P-LFO 波形
zh_tw: P-LFO 波形

# HeaderPLfoRate
source: P-LFO Rate
ar_sa: معدل P-LFO
es_es: Tasa P-LFO
zh_cn: P-LFO 速率
zh_tw: P-LFO 速率

# HeaderPLfoDepth
source: P-LFO Depth
ar_sa: عمق P-LFO
es_es: Prof. P-LFO
zh_cn: P-LFO 深度
zh_tw: P-LFO 深度

# HeaderALfoWaveform
source: A-LFO Wave
ar_sa: موجة A-LFO
es_es: Onda A-LFO
ko_kr: A-LFO 파형
zh_cn: A-LFO 波形
zh_tw: A-LFO 波形

# HeaderALfoRate
source: A-LFO Rate
ar_sa: معدل A-LFO
es_es: Tasa A-LFO
zh_cn: A-LFO 速率
zh_tw: A-LFO 速率

# HeaderALfoDepth
source: A-LFO Depth
ar_sa: عمق A-LFO
es_es: Prof. A-LFO
zh_cn: A-LFO 深度
zh_tw: A-LFO 深度

# DebugTabHeader
source: Debug
ar_sa: تصحيح الأخطاء
es_es: Depuración
ko_kr: 디버그
zh_cn: 调试
zh_tw: 偵錯

# DebugTabTooltip
source: Settings for debugging to help investigate issues.
ar_sa: إعدادات لتصحيح الأخطاء للمساعدة في التحقيق في المشكلات.
es_es: Configuración de depuración para ayudar a investigar problemas.
ko_kr: 문제가 발생했을 때 조사를 돕는 디버그 설정입니다.
zh_cn: 用于调试以帮助调查问题的设置。
zh_tw: 用於偵錯以協助調查問題的設定。

# LoggingGroupHeader
source: Logging
ar_sa: التسجيل
es_es: Registro
ko_kr: 로깅
zh_cn: 日志记录
zh_tw: 日誌記錄

# EnableLoggingCheckbox
source: Enable Logging
ar_sa: تمكين التسجيل
es_es: Habilitar Registro
ko_kr: 로깅 활성화
zh_cn: 启用日志
zh_tw: 啟用日誌

# EnableLoggingTooltip
source: Outputs plugin operation logs to a file. Useful for investigating issues.
ar_sa: إخراج سجلات تشغيل المكون الإضافي إلى ملف. مفيد للتحقيق في المشكلات.
es_es: Exporta los registros de operación del complemento a un archivo. Útil para investigar problemas.
ko_kr: 플러그인 동작 로그를 파일로 출력합니다. 문제 발생 시 원인 조사에 도움이 됩니다.
zh_cn: 将插件操作日志输出到文件。有助于调查问题。
zh_tw: 將外掛程式操作日誌輸出到檔案。有助於調查問題。

# VerboseLoggingCheckbox
source: Enable Verbose Logging
ar_sa: تمكين التسجيل المطول
es_es: Habilitar Registro Detallado
ko_kr: 상세 로깅 활성화
zh_cn: 启用详细日志
zh_tw: 啟用詳細日誌

# VerboseLoggingTooltip
source: Outputs more detailed logs.
ar_sa: إخراج سجلات أكثر تفصيلاً.
es_es: Genera registros más detallados.
ko_kr: 더 자세한 로그를 출력합니다.
zh_cn: 输出更详细的日志。
zh_tw: 輸出更詳細的日誌。

# LogFilePathLabel
source: Log File Path
ar_sa: مسار ملف السجل
es_es: Ruta Archivo de Registro
ko_kr: 로그 파일 경로
zh_cn: 日志文件路径
zh_tw: 日誌檔案路徑

# LogFilePathTooltip
source: Specify the output path for the log file.
ar_sa: تحديد مسار الإخراج لملف السجل.
es_es: Especifique la ruta de salida para el archivo de registro.
ko_kr: 로그 파일의 출력 경로를 지정합니다.
zh_cn: 指定日志文件的输出路径。
zh_tw: 指定日誌檔案的輸出路徑。

# MaxLogSizeLabel
source: Max Log Size (KB)
ar_sa: أقصى حجم للسجل (KB)
es_es: Tamaño Máx. Registro (KB)
ko_kr: 최대 로그 크기 (KB)
zh_cn: 最大日志大小 (KB)
zh_tw: 最大日誌大小 (KB)

# MaxLogSizeTooltip
source: Specify the maximum log file size in KB. Older logs are deleted when this limit is exceeded.
ar_sa: تحديد الحد الأقصى لحجم ملف السجل بالكيلوبايت. يتم حذف السجلات القديمة عند تجاوز هذا الحد.
es_es: Especifique el tamaño máximo del archivo de registro en KB. Los registros antiguos se eliminan cuando se supera este límite.
ko_kr: 로그 파일의 최대 크기를 KB 단위로 지정합니다. 이 한도를 초과하면 오래된 로그부터 삭제됩니다.
zh_cn: 指定日志文件的最大大小（KB）。超过此限制将删除旧日志。
zh_tw: 指定日誌檔案的最大大小（KB）。超過此限制將刪除舊日誌。

# LogLevelLabel
source: Log Level
ar_sa: مستوى السجل
es_es: Nivel de Registro
ko_kr: 로그 레벨
zh_cn: 日志级别
zh_tw: 日誌級別

# LogLevelTooltip
source: Set the detail level of the logs to output. Set in the range 1 (errors only) to 5 (all).
ar_sa: تعيين مستوى تفاصيل السجلات للإخراج. النطاق من 1 (الأخطاء فقط) إلى 5 (الكل).
es_es: Establece el nivel de detalle de los registros a generar. Rango de 1 (solo errores) a 5 (todo).
ko_kr: 출력할 로그의 상세 수준을 설정합니다. 1(오류만)에서 5(모두) 범위 내에서 설정합니다.
zh_cn: 设置要输出的日志的详细级别。范围从1（仅错误）到5（全部）。
zh_tw: 設定要輸出的日誌的詳細級別。範圍從1（僅錯誤）到5（全部）。

# LogViewerHeader
source: Log Viewer
ar_sa: عارض السجل
es_es: Visor de Registros
ko_kr: 로그 뷰어
zh_cn: 日志查看器
zh_tw: 日誌檢視器

# ClearLogButton
source: Clear
ar_sa: مسح
es_es: Limpiar
ko_kr: 지우기
zh_cn: 清除
zh_tw: 清除

# ApiIntegrationGroupHeader
source: API Integration
ar_sa: تكامل API
es_es: Integración API
ko_kr: API 연동
zh_cn: API 集成
zh_tw: API 整合

# EnableNamedPipeApiCheckbox
source: Enable Named Pipe API (for external integration)
ar_sa: تمكين API الأنابيب المسماة (للتكامل الخارجي)
es_es: Habilitar API de Tubería Nombrada (para integración externa)
ko_kr: 명명된 파이프 API 활성화 (외부 연동용)
zh_cn: 启用命名管道 API (用于外部集成)
zh_tw: 啟用命名管道 API (用於外部整合)

# EnableNamedPipeApiTooltip
source: When enabled
ar_sa: Cuando está habilitado
es_es: 활성화하면 외부 애플리케이션에서 플러그인 기능에 액세스할 수 있습니다. 변경 후 YMM4를 다시 시작해야 합니다.
id_id: las aplicaciones externas pueden acceder a las funciones del complemento. Requiere reiniciar YMM4 después del cambio.
ko_kr: 啟用後，外部應用程式可以存取外掛程式功能。更改後需要重啟YMM4。
zh_cn: external applications can access plugin features. Requires YMM4 restart after change.
zh_tw: 启用后，外部应用程序可以访问插件功能。更改后需要重启YMM4。

# ExperimentalFeaturesGroupHeader
source: Experimental Features
ar_sa: ميزات تجريبية
es_es: Funciones Experimentales
ko_kr: 실험적 기능
zh_cn: 实验性功能
zh_tw: 實驗性功能

# ShowMidiInfoWindowCheckbox
source: Show MIDI info window when adding MIDI file
ar_sa: إظهار نافذة معلومات MIDI عند إضافة ملف MIDI
es_es: Mostrar ventana de información MIDI al añadir archivo MIDI
ko_kr: MIDI 파일 추가 시 MIDI 정보 창 표시
zh_cn: 添加MIDI文件时显示MIDI信息窗口
zh_tw: 新增MIDI檔案時顯示MIDI資訊視窗

# ShowMidiInfoWindowTooltip
source: If enabled
ar_sa: Si está habilitado
es_es: 활성화된 경우 MIDI 파일을 타임라인에 추가할 때 해당 파일의 내부 MIDI 정보를 표시하는 창이 자동으로 열립니다. 디버깅 및 상세 정보 확인에 유용합니다。
id_id: se abrirá automáticamente una ventana que muestra la información MIDI interna del archivo al añadir un archivo MIDI a la línea de tiempo. Útil para depuración y confirmación detallada.
ko_kr: 如果啟用，在將MIDI檔案新增到時間軸時，將自動開啟一個顯示該檔案內部MIDI資訊的視窗。有助於偵錯和詳細資訊確認。
zh_cn: a window displaying internal MIDI information for the file will automatically open when adding a MIDI file to the timeline. Useful for debugging and detailed confirmation.
zh_tw: 如果启用，在将MIDI文件添加到时间轴时，将自动打开一个显示该文件内部MIDI信息的窗口。有助于调试和详细信息确认。
