Repository: routersys/YMM4-MIDI
Catalog: MIDI/Localization/Translate.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# OpenMidiEditorCheckbox
source: Open MIDI editor when adding MIDI file
ar_sa: فتح محرر MIDI عند إضافة ملف MIDI
es_es: Abrir editor MIDI al añadir archivo MIDI
ko_kr: MIDI 파일 추가 시 MIDI 편집기 열기
zh_cn: 添加MIDI文件时打开MIDI编辑器
zh_tw: 新增MIDI檔案時開啟MIDI編輯器

# OpenMidiEditorTooltip
source: If enabled
ar_sa: Si está habilitado
es_es: 활성화된 경우 MIDI 파일을 타임라인에 추가할 때 MIDI 편집기 창이 자동으로 열립니다.
id_id: la ventana del editor MIDI se abrirá automáticamente al añadir un archivo MIDI a la línea de tiempo.
ko_kr: 如果啟用，在將MIDI檔案新增到時間軸時，MIDI編輯器視窗將自動開啟。
zh_cn: the MIDI editor window will automatically open when adding a MIDI file to the timeline.
zh_tw: 如果启用，在将MIDI文件添加到时间轴时，MIDI编辑器窗口将自动打开。

# ShowReleaseNotesTooltip
source: Show release notes.
ar_sa: إظهار ملاحظات الإصدار.
es_es: Mostrar notas de la versión.
ko_kr: 릴리스 노트를 봅니다.
zh_cn: 显示发行说明。
zh_tw: 顯示發行說明。

# OpenPluginDirectoryTooltip
source: Open the plugins folder.
ar_sa: افتح مجلد الإضافات.
es_es: Abrir la carpeta de complementos.
ko_kr: 플러그인 폴더를 엽니다.
zh_cn: 打开插件文件夹。
zh_tw: 開啟外掛程式資料夾。

# RefreshFilesTooltip
source: Update the SFZ and SoundFont file lists.
ar_sa: تحديث قوائم ملفات SFZ و SoundFont.
es_es: Actualizar las listas de archivos SFZ y SoundFont.
ko_kr: SFZ 및 SoundFont 파일 목록을 새로 고칩니다.
zh_cn: 更新SFZ和SoundFont文件列表。
zh_tw: 更新SFZ和SoundFont檔案清單。

# ReloadConfigTooltip
source: Reloads the current settings from the file. Unsaved changes will be discarded.
ar_sa: إعادة تحميل الإعدادات الحالية من الملف. سيتم تجاهل التغييرات غير المحفوظة.
es_es: Recarga la configuración actual desde el archivo. Los cambios no guardados se descartarán.
ko_kr: 파일에서 현재 설정을 다시 로드합니다. 저장되지 않은 변경 사항은 삭제됩니다.
zh_cn: 从文件重新加载当前设置。未保存的更改将被丢弃。
zh_tw: 從檔案重新載入目前設定。未儲存的變更將被捨棄。

# Key_VersionChecking
source: Getting version information...
ar_sa: جارٍ الحصول على معلومات الإصدار...
es_es: Obteniendo información de la versión...
ko_kr: 버전 정보를 가져오는 중...
zh_cn: 正在获取版本信息...
zh_tw: 正在取得版本資訊...

# Key_VersionCurrent
source: Current Version: {0}
ar_sa: {الإصدار الحالي: {0
es_es: Versión Actual: {0}
ko_kr: 현재 버전: {0}
zh_cn: 当前版本: {0}
zh_tw: 目前版本: {0}

# Key_VersionNewAvailable
source: 新しいバージョンが利用可能です: {0}
ar_sa: {يتوفر إصدار جديد: {0
es_es: Nueva versión disponible: {0}
id_id: يتوفر إصدار جديد: {0}
ko_kr: 新版本可用: {0}
zh_cn: 新版本可用: {0}
zh_tw: 新版本可用: {0}

# Key_VersionUpToDate
source: Your version is up to date.
ar_sa: إصدارك محدّث.
es_es: Su versión está actualizada.
ko_kr: 현재 사용 중인 버전이 최신입니다.
zh_cn: 您的版本已是最新。
zh_tw: 您的版本已是最新。

# Key_VersionCheckFailed
source: Could not retrieve update information.
ar_sa: تعذر استرداد معلومات التحديث.
es_es: No se pudo recuperar la información de actualización.
ko_kr: 업데이트 정보를 가져올 수 없습니다.
zh_cn: 无法获取更新信息。
zh_tw: 無法取得更新資訊。

source: Loading...
ar_sa: جار التحميل...
es_es: Cargando...
ko_kr: 로드 중...
zh_cn: 加载中...
zh_tw: 載入中...

# SoundFontRadioButton
source: SoundFont
ko_kr: 사운드폰트
